{
  "?taskid=579": {
    "lessons": [
      "download.php?fileid=1527"
    ],
    "title": "Using Coordinates to Interpret and Represent Data",
    "objectives": [
      "To help you assess how well students are able to work in the coordinate plane to solve a problem in a real-world context.",
      "To identify and help students who have difficulty measuring and interpreting horizontal or vertical intervals on graphs."
    ],
    "standards": {
      "content": {
        "6.G": "Solve real-world and mathematical problems involving area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Pairs of scissors",
      "Graph paper",
      "Copy of lesson sheets",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/579.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You review their responses and create questions for them to consider when improving their work.</li><li>After a brief introduction, students work collaboratively in small groups interpreting a graph. They then exchange their interpretation with a group that worked on a different graph. Each group sketches the other group's interpretation as a graph.</li><li>Students then share their work.</li><li>In a whole-class discussion, students review what they have learned.</li><li>In a follow-up lesson students use their learning and your questions to review their work.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1528"
    ]
  },
  "?taskid=578": {
    "lessons": [
      "download.php?fileid=1525"
    ],
    "title": "Factors and Multiples",
    "objectives": [
      "To help you to assess how well students are able to understand the meanings of the terms 'Greatest Common Factor' (GCF) and 'Least Common Multiple' (LCM).",
      "To identify and help students who confuse GCFs and LCMs.",
      "To identify and help students who lack a sense of what values of GCF or LCM might be reasonable for a given pair of numbers."
    ],
    "standards": {
      "content": {
        "6.NS": "Compute fluently with multi-digit numbers and find common factors and multiples."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Cut-up card set",
      "Copy of the grid"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/578.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task, <em>Thinking of Two Numbers</em>, which is designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to consider in order to improve their work.</li><li>The lesson begins with a whole-class introduction, in which students review their understanding of the meanings of GCF and LCM. They then examine some sample student work and evaluate the different approaches taken.</li><li>Students then take part in a collaborative task, in pairs or groups of three, in which they complete a grid, finding numbers to satisfy different constraints of greatest common factor and least common multiple. As they do this, they learn more about how these quantities are related to each other and to the numbers.</li><li>In a whole-class discussion, students then consider their approaches to the task and share their conclusions.</li><li>In a follow-up lesson, students receive your comments on the assessment task and use these to attempt a similar task, <em>Thinking of Two Numbers (Revisited)</em>, approaching it with insights that they have gained from the lesson.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1526"
    ]
  },
  "?taskid=575": {
    "lessons": [
      "download.php?fileid=1508"
    ],
    "title": "Fractions, Decimals and Percents",
    "objectives": [
      "Students will be able to compare, convert between and order fractions, decimals and percents.",
      "Students will be able to use area and linear models of fractions, decimals and percents to understand equivalence."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of numbers to the system of rational numbers."
      },
      "practices": [
        "MP2",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Blank paper",
      "Copies of assessment tasks",
      "Poster paper",
      "Glue stick",
      "Cut-up card sets"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/575.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding. You then review their responses and create questions for students to consider when improving their work.</li><li>Students work in small groups on a collaborative discussion task, placing decimal/percent, and fraction cards in order, along with area and linear diagrams that assist them in justifying and explaining their thinking.</li><li>In a whole-class discussion, students discuss what they have learned.</li><li>Finally, students revisit their initial work on the assessment task and work alone on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1509"
    ]
  },
  "?taskid=574": {
    "lessons": [
      "download.php?fileid=1506"
    ],
    "title": "Describing Quadrilaterals",
    "objectives": [
      "To help you assess how well students are able to name and classify quadrilaterals according to their properties.",
      "To help you assess how well students are able to identify the minimal information required to define a quadrilateral.",
      "To help you assess how well students are able to sketch quadrilaterals with given conditions."
    ],
    "standards": {
      "content": {
        "7.G": "Draw, construct, and describe geometrical figures and describe the relationships between them."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP8"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Copies of sketching quadrilaterals",
      "Copy of cut-up card sets",
      "Scissors",
      "Glue-sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/574.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to consider to help them improve their work.</li><li>After a whole-class introduction, students work first individually, then in small groups on a collaborative task, sketching quadrilaterals from a set of properties and identifying the minimal information required to complete the sketch.</li><li>A whole-class discussion is held to explore the different combinations of property cards used by students when sketching the quadrilaterals.</li><li>Finally students work individually either on a new assessment task, or return to the original task and try to improve their responses.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1507"
    ]
  },
  "?taskid=573": {
    "lessons": [
      "download.php?fileid=1504"
    ],
    "title": "Applying Properties of Exponents",
    "objectives": [
      "To help you assess how well students are able to recall and use the properties of exponents to generate equivalent numeric expressions.",
      "To help you assess how well students are able to check the numerical value of an expression involving exponents without using a calculator."
    ],
    "standards": {
      "content": {
        "8.EE": "Work with radicals and integer exponents."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and eraser",
      "Large poster papers",
      "Copies of cut-up card sets",
      "Glue-sticks"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/573.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work in small groups on a collaborative discussion task, grouping cards based on numerical equivalence. Throughout their work, students justify and explain their thinking and reasoning.</li><li>Students review their work by comparing their card groupings with their peers'.</li><li>In a whole-class discussion, students discuss what they have learned.</li><li>In a follow-up lesson, students revisit their initial work on the assessment task and work alone on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1505"
    ]
  },
  "?taskid=438": {
    "lessons": [
      "download.php?fileid=1275"
    ],
    "title": "Medical Testing",
    "objectives": [
      "To help you assess how well students are able to make sense of a real life situation and decide what math to apply to the problem.",
      "To help you assess how well students are able to understand and calculate the conditional probability of an event A, given an event B, and interpret the answer in terms of a model.",
      "To help you assess how well students are able to represent events as a subset of a sample space using tables, tree diagrams, and Venn diagrams.",
      "To help you assess how well students are able to interpret the results and communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "H.F-BF": "Build a function that models a relationship between two quantities",
        "H.S-CP": "Use the rules of probability to compute probabilities of compound  events in a uniform probability model"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of the questionnaire",
      "Copies of sample responses",
      "Copies of lesson resources",
      "Large sheets of poster paper and felt-tipped pens",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/438.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current levels of understanding and difficulties. You then review their work, and create questions for students to answer to help them improve their solutions.</li><li>At the start of the lesson, students work alone answering your questions about the same problem. They are then grouped and engage in a collaborative discussion of the same task. </li><li>In the same small groups, students are given sample solutions to comment on and evaluate.</li><li>In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li><li>Finally, students review what they have learned.</li></ul>"
    ],
    "time": [
      110
    ],
    "resources": [
      "download.php?fileid=1276",
      "http://map.mathshell.org/lesson_support/medical_testing.htm",
      "download.php?fileid=1279",
      "download.php?fileid=1278",
      "http://map.mathshell.org/lesson_support/medical_testing.htm",
      "download.php?fileid=1279",
      "download.php?fileid=1278",
      "download.php?fileid=1279",
      "download.php?fileid=1278"
    ]
  },
  "?taskid=571": {
    "lessons": [
      "download.php?fileid=1502"
    ],
    "title": "Proportional Reasoning",
    "objectives": [
      "To help you assess how well students are able to reason proportionally when comparing the relationship between two quantities expressed as unit rates and/or part-to-part ratios.",
      "To help you assess how well students are able to describe a ratio relationship between two quantities.",
      "To help you assess how well students are able to compare ratios expressed in different ways.",
      "To help you assess how well students are able to use proportional reasoning to solve a real-world problem."
    ],
    "standards": {
      "content": {
        "6.RP": "Understand ratio concepts and use ratio reasoning to solve problems."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Mini-whiteboard, pen and eraser",
      "Copies of task sheets",
      "Cut-up card sets",
      "Poster papers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/571.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task, <em>Mixing Drinks</em>, designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to consider, in order to improve their work.</li><li>After a whole-class introduction, students work in small groups, putting diagrams and descriptions of particular mixtures of orange and soda into order of strength.</li><li>Students then compare their work with their peers.</li><li>Next, in a whole-class discussion, students comment on and critique some sample student statements in which reasons are given as to why two mixtures would or wouldn't taste the same.</li><li>Students then have the opportunity to revise their card ordering and correct any misplaced cards.</li><li>After a final whole-class discussion, students work individually either on a new assessment task, <em>Mixing Drinks (revisited),</em> or return to the original task and try to improve their responses.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1503"
    ]
  },
  "?taskid=436": {
    "lessons": [
      "download.php?fileid=1271"
    ],
    "title": "Representing Polynomials",
    "objectives": [
      "To help you assess how well students are able to translate between graphs and algebraic representations of polynomials.",
      "To help you identify and assist students who have difficulties in recognizing the connection between the zeros of polynomials when suitable factorizations are available, and graphs of the functions defined by polynomials.",
      "To help you identify and assist students who have difficulties in recognizing the connection between transformations of the graphs and transformations of the functions obtained by replacing <em>f</em>(<em>x</em>) by <em>f</em>(<em>x </em>+ k), <em>f</em>(<em>x</em>) + k, -<em>f</em>(<em>x</em>), <em>f</em>(-<em>x</em>)."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Interpret the structure of expressions",
        "H.A-APR": "Understand the relationship between zeros and factors of polynomials",
        "H.F-BF": "Build new functions from existing functions",
        "H.F-IF": "Analyze functions using different representations"
      },
      "practices": [
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/436.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the assessment task individually. You then review students' work and formulate questions that will help them improve their solutions.</li><li>During the lesson, students work collaboratively in pairs or threes, matching functions to their graphs and creating new examples. Throughout their work students justify and explain their decisions to peers. During a whole-class discussion, students explain their reasoning. </li><li>Finally, students work individually again to improve their solutions to the assessment task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1272"
    ]
  },
  "?taskid=208": {
    "lessons": [
      "download.php?fileid=1521"
    ],
    "title": "Interpreting Distance-Time Graphs",
    "objectives": [
      "To help you assess how well students are able to interpret distance-time graphs.",
      "To help you identify students who interpret distance-time graphs as if they are pictures of situations rather than abstract representations of them.",
      "To help you identify students who have difficulty relating speeds to slopes of these graphs."
    ],
    "standards": {
      "content": {
        "8.F": "Use functions to model relationships between quantities."
      },
      "practices": [
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/208.png",
    "context": [
      "<ul> <li>Before the lesson, students work on a task designed to reveal their current understandings and difficulties. You review their work and create questions for students to answer in order to improve their solutions.</li> <li>A whole-class introduction provides students with guidance on how to work through the first task. Students then work in small groups on a collaborative discussion task, matching verbal interpretations with graphs. As they do this, they translate between words and graphical features, and begin to link the representations. </li> <li>This is followed by a whole-class discussion about applying realistic data to a graph. </li> <li>Students next work in small groups, matching tables of data to the existing matched pairs of cards. They then explain their reasoning to another group of students.</li> <li>In a final whole-class discussion, students draw their own graphs from verbal interpretations. </li> <li>Finally, students return to their original task and try to improve their individual responses. </li> </ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1519"
    ]
  },
  "?taskid=403": {
    "lessons": [
      "download.php?fileid=1194"
    ],
    "title": "Inscribing and Circumscribing Right Triangles",
    "objectives": [
      "To help you assess how well students are able to use geometric properties to solve problems.",
      "Tt will help you identify and help students who have difficulty decomposing complex shapes into simpler ones in order to solve a problem.",
      "Tt will help you identify and help students who have difficulty bringing together several geometric concepts to solve a problem.",
      "Tt will help you identify and help students who have difficulty finding the relationship between radii of inscribed and circumscribed circles of right triangles."
    ],
    "standards": {
      "content": {
        "H.G-C": "Understand and apply theorems about circles",
        "H.A-CED": "Create equations that describe numbers or relationships",
        "H.G-SRT": "Define trigonometric ratios and solve problems involving right triangles",
        "H.G-CO": "Make geometric constructions"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of task",
      "Mini-whiteboard, pen and eraser",
      "Copies of right triangles and sample responses",
      "Compasses, rulers, pencils and protractors",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/403.png",
    "context": [
      "<ul><li>This lesson is designed to enable students to develop strategies for describing relationships between right triangles and the radii of their inscribed and circumscribed circles.</li><li>Before the lesson students attempt the problem individually. You review their work and formulate questions for students to answer in order to improve their solutions.</li> <li>At the start of the lesson students work alone answering your questions. </li> <li>Students then work in groups in a collaborative discussion of the same task. In the same small groups, students are given some sample solutions to evaluate and comment on.</li> <li>In a whole class discussion, students explain and compare the alternative solution strategies they have seen and used. </li> <li>Finally, students review what they have learnt.</li> </ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1195"
    ]
  },
  "?taskid=407": {
    "lessons": [
      "download.php?fileid=1204"
    ],
    "title": "Modeling: Having Kittens",
    "objectives": [
      "To help you assess how well students are able to interpret a situation and represent the constraints and variables mathematically.",
      "To help you assess how well students are able to select appropriate mathematical methods to use.",
      "To help you assess how well students are able to make sensible estimates and assumptions.",
      "To help you assess how well students are able to investigate an exponentially increasing sequence.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "H.F-LE": "Construct and compare linear and exponential models and solve problems",
        "H.N-Q": "Reason quantitatively and use units to solve problems"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4",
        "MP5"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Calculators",
      "Copy of sample responses",
      "Poster papers and felt-tipped pens",
      "Graph paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/407.png",
    "context": [
      "<ul><li>This lesson is designed to help students develop strategies for modeling. Note that a video of this lesson is available in the professional development materials. </li><li>Before the lesson, students attempt the problem individually. You then review their work and write questions to help students improve their solutions.</li> <li>At the start of the lesson, students work individually answering questions about the same problem. In small groups, students then work collaboratively on the task. In the same small groups, students evaluate sample solutions. In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li> <li>In a follow-up lesson, students review what they have learned.</li> </ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1205"
    ]
  },
  "?taskid=406": {
    "lessons": [
      "download.php?fileid=1202"
    ],
    "title": "Equations of Circles 1",
    "objectives": [
      "To help you assess how well students are able to use the Pythagorean theorem to derive the equation of a circle.",
      "To help you assess how well students are able to translate between the geometric features of circles and their equations."
    ],
    "standards": {
      "content": {
        "<a class=\"standardcode\" href=\"stds.php?id=1426\" title=\"Expressing Geometric Properties with Equations\">H.G-GPE</a>": "Expressing Geometric Properties with Equations",
        "H.A-CED": "Create equations that describe numbers or relationships"
      },
      "practices": [
        "MP1",
        "MP5",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Cut-up card sets",
      "Compass",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/406.png",
    "context": [
      "<ul> <li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li> <li>After a whole-class introduction students work collaboratively, categorizing equations and geometric descriptions of circles.</li> <li>Towards the end of the lesson there is a whole-class discussion.</li> <li>In a follow-up lesson, students again work alone on a similar task to the introductory assessment task.</li> </ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1203"
    ]
  },
  "?taskid=405": {
    "lessons": [
      "download.php?fileid=1200"
    ],
    "title": "Modeling Conditional Probabilities 2",
    "objectives": [
      "To help you assess how well students understand conditional probability.",
      "To help you identify and assist students who have the following difficulties representing events as a subset of a sample space using tables and tree diagrams.",
      "To help you identify and assist students who have the following difficulties understanding when conditional probabilities are equal for particular and general situations."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Write expressions in equivalent forms to solve problems",
        "H.F-BF": "Build a function that models a relationship between two quantities",
        "H.S-CP": "Understand independence and conditional probability and use them to  interpret data",
        "H.S-MD": "Calculate expected values and use them to solve problems"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Cut-up card sets",
      "Poster papers and felt-tipped pens",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/405.png",
    "context": [
      "<ul> <li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li> <li>During the lesson, students first work collaboratively on a related task. They have an opportunity to extend and generalize this work. The lesson ends with a whole-class discussion. </li> <li>In a subsequent lesson, students revise their individual solutions to the assessment task.</li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1201"
    ]
  },
  "?taskid=404": {
    "lessons": [
      "download.php?fileid=1230"
    ],
    "title": "Representing Data 1: Using Frequency Graphs",
    "objectives": [
      "To help you assess how well students are able to use frequency graphs to identify a range of measures and make sense of this data in a real-world context.",
      "To help you assess how well students understand that a large number of data points allow a frequency graph to be approximated by a continuous distribution."
    ],
    "standards": {
      "content": {
        "H.S-ID": "Summarize, represent, and interpret data on a single count or measurement variable"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of handouts",
      "Mini-whiteboard, pen and eraser",
      "Cut-up card sets",
      "Poster papers",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/404.png",
    "context": [
      "<ul> <li>Before the lesson, students complete an assessment task individually that is designed to reveal their current understanding. </li> <li>A whole-class introduction provides students with guidance on how to work through the task. Students work in pairs or threes on a collaborative discussion task, matching written interpretations and graphs as they begin to link these two representations.</li> <li>Towards the end of the lesson there is a whole-class discussion.</li> <li>In a follow-up lesson, students work alone on a similar task to the assessment task.</li><li>This lesson can be taught in conjunction with the lesson <em>Representing Data Using Box Plots</em> or independently.</li></ul>"
    ],
    "time": [
      65
    ],
    "resources": [
      "download.php?fileid=1514"
    ]
  },
  "?taskid=409": {
    "lessons": [
      "download.php?fileid=1215"
    ],
    "title": "Modeling Conditional Probabilities 1: Lucky Dip",
    "objectives": [
      "To help you assess how well students are able to understand conditional probability.",
      "To help you assess how well students are able to represent events as a subset of a sample space using tables and tree diagrams.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "H.S-CP": "Understand independence and conditional probability and use them to  interpret data",
        "H.S-MD": "Calculate expected values and use them to solve problems"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and eraser",
      "Copies of student responses",
      "Poster papers and felt-tipped pens",
      "Bag and white + black balls",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/409.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>At the start of the lesson, students work alone answering your questions about the same problem. Students are then grouped and engage in a collaborative discussion of the same task. </li><li>In the same small groups, students are given sample solutions to analyze and evaluate.</li><li>Finally, in a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li><li>Finally, students review what they have learnt.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1209"
    ]
  },
  "?taskid=408": {
    "lessons": [
      "download.php?fileid=1206"
    ],
    "title": "The Pythagorean Theorem: Square Areas",
    "objectives": [
      "To help you assess how well students are able to use the area of right triangles to deduce the areas of other shapes.",
      "To help you assess how well students are able to use dissection methods for finding areas.",
      "To help you assess how well students are able to organize an investigation systematically and collect data.",
      "To help you assess how well students are able to deduce a generalizable method for finding lengths and areas (The Pythagorean Theorem.)"
    ],
    "standards": {
      "content": {
        "8.G": "Understand and apply the Pythagorean Theorem."
      },
      "practices": [
        "MP1",
        "MP6",
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Copies of dotted grid paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/408.png",
    "context": [
      "<ul> <li>Before the lesson, students attempt a task individually. You review their work and create questions for students to answer in order to improve their solutions. </li> <li>A whole-class introduction poses the problem of finding the areas of 'tilted squares' drawn on a square grid. Students share different approaches for calculating areas and are offered three generalizable methods that they might use. Students are asked to find possible areas of 'tilted squares' at a specific tilt. This requires a systematic approach. </li> <li>In a whole-class discussion results are shared and organized. The method is generalized into the Pythagorean theorem. </li> <li>Finally, students work individually on a new assessment task.</li> </ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1207"
    ]
  },
  "?taskid=489": {
    "lessons": [
      "download.php?fileid=1366"
    ],
    "title": "Sharing Costs: Travelling to School",
    "objectives": [
      "To help you assess how well students are able to solve a real-world modeling problem. There are several correct approaches to the problem, including some that involve proportional relationships."
    ],
    "standards": {
      "content": {
        "6.RP": "Understand ratio concepts and use ratio reasoning to solve problems."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Copies of review questionnaire",
      "Copies of sample student responses",
      "Mini-whiteboard, pen and an eraser",
      "Poster paper and marker pens",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/489.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You then review their work and create questions for them to answer in order to improve their solutions.</li><li>At the start of the lesson students work alone, answering your questions about the same problem. They are then grouped and engage in a collaborative discussion of the same task. </li><li>In the same small groups, students are given sample solutions to comment on and evaluate.</li><li>In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li><li>Finally, students reflect on their work.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1367"
    ]
  },
  "?taskid=488": {
    "lessons": [
      "download.php?fileid=1364"
    ],
    "title": "Designing: Candy Cartons",
    "objectives": [
      "To help you assess how well students are able to select appropriate mathematical methods to use for an unstructured problem.",
      "To help you assess how well students are able to interpret a problem situation, identifying constraints and variables, and specify assumptions.",
      "To help you assess how well students are able to work with 2- and 3-dimensional shapes to solve a problem involving capacity and surface area.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "6.G": "Solve real-world and mathematical problems involving area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of task sheet",
      "Poster papers",
      "Sheets of light, letter-sized cardboard",
      "Glue stick",
      "Highlighter pens",
      "Copies of sample student responses",
      "Calculators, rules, protractors, pencils, grid and plain papers, compassess, cylinderical counters",
      "Mini-whiteboard, pen and an eraser",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/488.png",
    "context": [
      "<ul><li>Before the first lesson, students tackle the problem individually. You review their work and write questions to help students improve their solutions. </li><li>At the beginning of the first lesson, students respond to your questions. They are then grouped into pairs and work collaboratively to produce better solutions to the same task, and use their designs to make two cartons.</li><li>To launch the second lesson there is a whole-class discussion. Then in small groups students evaluate and comment on sample solutions, followed by a whole-class discussion about the work. Finally, students review and evaluate their work on the problem. </li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1365"
    ]
  },
  "?taskid=483": {
    "lessons": [
      "download.php?fileid=1520"
    ],
    "title": "Proportion and Non-proportion Situations",
    "objectives": [
      "To help you assess whether students are able to identify when two quantities vary in direct proportion to each other.",
      "To help you assess whether students are able to distinguish between direct proportion and other functional relationships.",
      "To help you assess whether students are able to solve proportionality problems using efficient methods."
    ],
    "standards": {
      "content": {
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems."
      },
      "practices": [
        "MP1",
        "MP8"
      ]
    },
    "materials": [
      "Calculator",
      "Mini-whiteboard, pen and an eraser",
      "Copies of the assessment task",
      "Copies of lesson tasks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/483.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current levels of understanding. You review their scripts and write questions to help students improve their solutions. </li><li>At the beginning of the lesson, there is a whole-class discussion about key features of direct proportionality. </li><li>Students then work in small groups on a task related to the assessment task. They write and solve their own questions on direct proportion, exchange questions with another group, assess each other's work, and write suggestions for improvement. </li><li>In a whole-class discussion, students share their questions and solution methods, generalizing to identify criteria for identifying direct proportion. </li><li>In a follow-up lesson, students use their learning and your questions to review their work. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1481"
    ]
  },
  "?taskid=482": {
    "lessons": [
      "download.php?fileid=1354"
    ],
    "title": "Optimizing: Security Cameras",
    "objectives": [
      "To help you assess how well students are able to analyze a realistic situation mathematically.",
      "To help you assess how well students are able to construct sight lines to decide which areas of a room are visible or hidden from a camera.",
      "To help you assess how well students are able to find and compare areas of triangles and quadrilaterals.",
      "To help you assess how well students are able to calculate and compare percentages and/or fractions of areas."
    ],
    "standards": {
      "content": {
        "6.G": "Solve real-world and mathematical problems involving area, surface area, and volume.",
        "6.RP": "Understand ratio concepts and use ratio reasoning to solve problems."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Mini-whiteboard, pen and an eraser",
      "Copies of the assessment task",
      "Copies of lesson resources",
      "Poster paper and felt-tipped pens",
      "Glue sticks",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/482.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Security Cameras</em> task individually. You review their responses, and formulate questions for students to consider in order to improve their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the <em>Security Cameras</em> task, in the form of a poster. </li><li>In the same small groups, students evaluate and comment on sample responses, identifying the strengths and weaknesses in these responses and comparing them with their own work. </li><li>In a whole-class discussion students compare and evaluate the methods they have seen and used.</li><li>In a follow-up lesson, students spend ten minutes reflecting on their work and what they have learned.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1355"
    ]
  },
  "?taskid=487": {
    "lessons": [
      "download.php?fileid=1362"
    ],
    "title": "Building and Solving Equations 1",
    "objectives": [
      "To help you assess how well students are able to create and solve linear equations.",
      "To help you identify and help students who have difficulties solving equations with one variable.",
      "To help you identify and help students who have difficulties solving linear equations in more than one way."
    ],
    "standards": {
      "content": {
        "8.EE": "Analyze and solve linear equations and pairs of simultaneous linear equations."
      },
      "practices": [
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Mini-whiteboard, pen and an eraser",
      "Copies of the assessment tasks",
      "Cut-up lesson resources",
      "Blank sheets of paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/487.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current levels of understanding and difficulties. You then review their work and create questions for students to consider when improving their solutions.</li><li>During the lesson(s), students work in pairs on collaborative activities. They evaluate sample student work and create linear equations for each other to solve. </li><li>During a final whole-class discussion students review the main mathematical concepts of the lesson. </li><li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task. </li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1363"
    ]
  },
  "?taskid=486": {
    "lessons": [
      "download.php?fileid=1360"
    ],
    "title": "Mean, Median, Mode, and Range",
    "objectives": [
      "To help you assess how well students are able to calculate the mean, median, mode, and range from a frequency chart.",
      "To help you assess how well students are able to use a frequency chart to describe a possible data set, given information on the mean, median, mode, and range."
    ],
    "standards": {
      "content": {
        "6.SP": "Develop understanding of statistical variability."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Cut-up card sets",
      "Large sheets of paper",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/486.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work in small groups on a collaborative task, matching bar charts with statistical tables.</li><li>To end the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students again work alone on a task similar to the initial assessment task.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1361"
    ]
  },
  "?taskid=484": {
    "lessons": [
      "download.php?fileid=1358"
    ],
    "title": "Laws of Arithmetic",
    "objectives": [
      "To help you assess how well students are able to perform arithmetic operations, including those involving whole-number exponents, recognizing and applying the conventional order of operations.",
      "To help you assess how well students are able to write and evaluate numerical expressions from diagrammatic representations and be able to identify equivalent expressions.",
      "To help you assess how well students are able to apply the distributive and commutative properties appropriately.",
      "To help you assess how well students are able to use the method for finding areas of compound rectangles."
    ],
    "standards": {
      "content": {
        "6.G": "Solve real-world and mathematical problems involving area, surface area, and volume.",
        "6.EE": "Apply and extend previous understandings of arithmetic to algebraic expressions."
      },
      "practices": [
        "MP1",
        "MP5",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up card sets",
      "Large sheets of paper",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/484.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work collaboratively on a card matching activity.</li><li>Towards the end of the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students work alone on a similar task to the introductory assessment task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1359"
    ]
  },
  "?taskid=551": {
    "lessons": [
      "download.php?fileid=1581"
    ],
    "title": "Interpreting Multiplication and Division",
    "objectives": [
      "To help students to interpret the meaning of multiplication and division. Many students have a very limited understanding of these operations and only recognise them in terms of 'times' and 'share'. They find it hard to give any meaning to calculations that involve non-integers. This is one reason why they have difficulty when choosing the correct operation to perform when solving word problems."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of multiplication and division to divide fractions by fractions."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Large sheets of paper and felt-tipped pens",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/551.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current levels of understanding. You review their scripts and write questions to help them improve their work.</li><li>In the lesson, students are asked to work collaboratively matching cards that contain symbols, cards that describe the structure of the situations and cards that contain word problems. This is done in two phases. After each phase there is a whole-class discussion that reflects on the structures that are being learned.</li><li>In a follow-up lesson, students use their learning and your questions to review their initial answers and to complete another task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1463"
    ]
  },
  "?taskid=222": {
    "lessons": [
      "download.php?fileid=696"
    ],
    "title": "Geometry Problems: Circles and Triangles",
    "objectives": [
      "To help you assess how well students are able to use geometric properties to solve problems.",
      "To help you identify and help students who have the difficulties solving problems by determining the lengths of the sides in right triangles.",
      "To help you identify and help students who have the difficulties finding the measurements of shapes by decomposing complex shapes into simpler ones.",
      "To help students to recognize that there may be different approaches to geometrical problems, and to understand the relative strengths and weaknesses of those approaches."
    ],
    "standards": {
      "content": {
        "H.G-C": "Understand and apply theorems about circles",
        "H.G-SRT": "Define trigonometric ratios and solve problems involving right triangles"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP6",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the task sheet",
      "Pencil and ruler",
      "Calculator",
      "Mini-whiteboard, pen and an eraser",
      "Copies of sample responses",
      "Large sheets of paper",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/222.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the problem individually. You then review their work and create questions for students to answer in order to improve their solutions. </li><li>During the lesson, students work collaboratively in small groups to produce an improved solution to the same problem. </li><li>Working in the same small groups, students comment on and evaluate some solutions produced by students in another class.</li><li>In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li><li>Finally, students review the work they did on their individual solutions and write about what they learned.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=697"
    ]
  },
  "?taskid=221": {
    "lessons": [
      "download.php?fileid=694"
    ],
    "title": "Interpreting Algebraic Expressions",
    "objectives": [
      "To help you assess how well students are able to translate between words, symbols, tables, and area representations of algebraic expressions.",
      "To help you to identify and support students who have difficulty in recognizing the order of algebraic operations.",
      "To help you to identify and support students who have difficulty in recognizing equivalent expressions.",
      "To help you to identify and support students who have difficulty in understanding the distributive laws of multiplication and division over addition (expansion of parentheses)."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Interpret the structure of expressions",
        "H.A-APR": "Rewrite rational expressions"
      },
      "practices": [
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of cut-up card sets",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Large sheets of paper and a felt-tipped pen",
      "Glue stick",
      "Envelopes and paper clips",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/221.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their work, and formulate questions for students to answer, to help them improve their solutions. </li><li>During the lesson, students work in pairs or threes to translate between word, symbol, table of values, and area representations of expressions. </li><li>In a whole-class discussion, students find different representations of expressions and explain their answers. </li><li>Finally, students return to their original assessment task, and try to improve their own responses. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=695"
    ]
  },
  "?taskid=220": {
    "lessons": [
      "download.php?fileid=692"
    ],
    "title": "Estimations and Approximations: The Money Munchers",
    "objectives": [
      "To help you assess how well students are able to model a situation.",
      "To help you assess how well students are able to make sensible, realistic assumptions and estimates.",
      "To help you assess how well students are able to use assumptions and estimates to create a chain of reasoning, in order to solve a practical problem."
    ],
    "standards": {
      "content": {
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the task sheet",
      "Calculators",
      "Copies of sample responses",
      "Poster paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/220.png",
    "context": [
      "<ul><li>In this unit, students choose and use mathematics to model a problem situation.</li><li>Before the lesson, students attempt the task <em>The Money Munchers</em> individually. You then review their work and create questions for them to answer in order to improve their solutions. </li><li>At the start of the lesson, students again work individually on <em>The Money Munchers</em> task, answering your questions. </li><li>Next, students work collaboratively in small groups. Their task is to produce a better solution to <em>The Money Munchers</em> than they did individually. Then, working in the same small groups, students analyze responses to <em>The Money Munchers</em> written by students in another class. </li><li>In a whole-class discussion, students compare and evaluate the solution methods they have seen and used. </li><li>In the final part of the lesson, students spend ten minutes reviewing their individual solutions, and writing about what they have learned. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=693"
    ]
  },
  "?taskid=554": {
    "lessons": [
      "download.php?fileid=1466"
    ],
    "title": "Building and Solving Equations 2",
    "objectives": [
      "To help you assess how well students are able to create and solve linear and non-linear equations.",
      "To help identify and help students who have the difficulties solving equations where the unknown appears once or more than once.",
      "To help identify and help students who have the difficulties solving equations in more than one way."
    ],
    "standards": {
      "content": {
        "H.A-REI": "Understand solving equations as a process of reasoning and explain  the reasoning"
      },
      "practices": [
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Calculators",
      "Mini-whiteboard, pen and an eraser",
      "Sheets of paper",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current levels of understanding and difficulties. You then review their work and create questions for students to consider when improving their solutions.</li><li>Students work collaboratively building and solving equations in which the unknown appears more than once in the equation.</li><li>During a final whole-class discussion students review the main mathematical concepts of the lesson.</li><li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1467"
    ]
  },
  "?taskid=225": {
    "lessons": [
      "download.php?fileid=701"
    ],
    "title": "Evaluating Statements About Probability",
    "objectives": [
      "To addresses common misconceptions relating to probability of simple and compound events.",
      "The lesson will help you assess how well students understand concepts of wqually likely events.",
      "The lesson will help you assess how well students understand concepts of randomness.",
      "The lesson will help you assess how well students understand concepts of sample sizes."
    ],
    "standards": {
      "content": {
        "7.SP": "Investigate chance processes and develop, use, and evaluate probability models."
      },
      "practices": [
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Large sheets of paper",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/225.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work, and create questions for students to answer in order to improve their solutions.</li><li>After a whole-class introduction, pairs of students work together to justify or refute mathematical statements. They do this using their own examples and counterexamples. Students then explain their reasoning to another group of students.</li><li>In a plenary discussion students review the main mathematical concepts of the lesson.</li><li>Students return to their original assessment tasks, and try to improve their own responses. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=702"
    ]
  },
  "?taskid=224": {
    "lessons": [
      "download.php?fileid=700"
    ],
    "title": "Forming Quadratics",
    "objectives": [
      "To help you assess how well students are able to understand what the different algebraic forms of a quadratic function reveal about the properties of its graphical representation.",
      "To help you identify and help students who have difficulties understanding how the factored form of the function can identify a graph's roots.",
      "To help you identify and help students who have difficulties understanding how the completed square form of the function can identify a graph's maximum or minimum point.",
      "To help you identify and help students who have difficulties Understanding how the standard form of the function can identify a graph's intercept."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Write expressions in equivalent forms to solve problems",
        "H.F-IF": "Analyze functions using different representations"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up lesson cards"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/224.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work, and create questions for students to answer in order to improve their solutions.</li><li>After a whole-class interactive introduction, students work in pairs on a collaborative discussion task in which<em> </em>they match quadratic graphs to their algebraic representation. As they do this, they begin to link different algebraic forms of a quadratic function to particular properties of its graph.</li><li>After a whole-class discussion, students return to their original assessment tasks and try to improve their own responses.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=984"
    ]
  },
  "?taskid=558": {
    "lessons": [
      "download.php?fileid=1474"
    ],
    "title": "Estimating and Sampling: Jellybeans",
    "objectives": [
      "To help you assess how well students are able to model a situation mathematically, justifying any assumptions made.",
      "To help you assess how well students are able to estimate unknown values/missing information when solving a problem.",
      "To help you assess how well students are able to calculate volumes of three-dimensional objects.",
      "To help you assess how well students are able to use an appropriate sampling method to draw conclusions about a population."
    ],
    "standards": {
      "content": {
        "8.G": "Solve real-world and mathematical problems involving volume of cylinders, cones, and spheres."
      },
      "practices": [
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copy of questionnaire",
      "blank paper",
      "Large sheets of paper",
      "Copies of student responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/558.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Jellybeans</em> task individually. You then assess their responses and formulate questions that will prompt students to review their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the <em>Jellybeans</em> task, in the form of a poster.</li><li>In the same small groups, students evaluate and comment on sample responses, identifying the strengths and weaknesses in each approach and comparing them with their own work.</li><li>In a whole-class discussion students compare and evaluate the methods they have seen and used.</li><li>In a follow-up lesson, students reflect on their work and what they have learned.</li></ul>"
    ],
    "time": [
      95
    ],
    "resources": [
      "download.php?fileid=1475"
    ]
  },
  "?taskid=410": {
    "lessons": [
      "download.php?fileid=1225"
    ],
    "title": "Modeling: Making Matchsticks",
    "objectives": [
      "To help you assess how well students are able to interpret a situation and represent the variables mathematically.",
      "To help you assess how well students are able to select appropriate mathematical methods.",
      "To help you assess how well students are able to interpret and evaluate the data generated.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "8.G": "Solve real-world and mathematical problems involving volume of cylinders, cones, and spheres."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Calculator",
      "Copies of lesson resources",
      "Copy of questionnaire",
      "Blank paper",
      "Large sheets of paper and felt-tipped pen",
      "Copies of student responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/410.png",
    "context": [
      "<ul><li>This lesson is designed to enable students to develop strategies for solving real-life problems. The problem is characterized by the use of appropriate units and formulas.</li><li>Before the lesson, students tackle the problem individually. You assess their responses and formulate questions that will prompt them to review their work.</li> <li>At the start of the lesson, students respond individually to the questions set, and then work in groups to combine their thinking and produce a collaborative solution in the form of a poster. </li> <li>In the same small groups, students evaluate and comment on some sample responses. They identify the strengths and mistakes in these responses and compare them with their own work.</li> <li>In a whole-class discussion, students explain and compare the solution strategies they have seen and used. </li> <li>Finally, students reflect on their work and their learning.</li> </ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1224"
    ]
  },
  "?taskid=411": {
    "lessons": [
      "download.php?fileid=1213"
    ],
    "title": "Classifying Solutions to Systems of Equations",
    "objectives": [
      "To help you assess how well students are able to classify solutions to a pair of linear equations by considering their graphical representations.",
      "To help you identify and assist students who have difficulties in using substitution to complete a table of values for a linear equation.",
      "To help you identify and assist students who have difficulties in identifying a linear equation from a given table of values.",
      "To help you identify and assist students who have difficulties in graphing and solving linear equations."
    ],
    "standards": {
      "content": {
        "8.EE": "Analyze and solve linear equations and pairs of simultaneous linear equations."
      },
      "practices": [
        "MP1",
        "MP4",
        "MP6"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of card sets",
      "Copies of lesson resources",
      "Blank paper",
      "Large sheets of poster paper",
      "Transparency pen",
      "Rulers",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/411.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the assessment task individually. You then review students' solutions and formulate questions that will help them improve their work.</li><li>During the lesson, students work collaboratively in pairs or threes, plotting graphs, completing tables of values and deducing equations. Then, based on the number of common solutions, students link these representations. </li><li>After a final whole-class discussion, students work individually on a new assessment task.</li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1214"
    ]
  },
  "?taskid=414": {
    "lessons": [
      "download.php?fileid=1221"
    ],
    "title": "Estimating Length Using Scientific Notation",
    "objectives": [
      "To help you assess how well students are able to estimate lengths of everyday objects.",
      "To help you assess how well students are able to convert between decimal and scientific notation.",
      "To help you assess how well students are able to make comparisons of the size of numbers expressed in both decimal and scientific notation."
    ],
    "standards": {
      "content": {
        "8.EE": "Work with radicals and integer exponents."
      },
      "practices": [
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of card sets",
      "Large sheets of poster paper",
      "Glue stick",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/414.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their responses and create questions for students to consider in order to improve their work.</li><li>After a whole-class introduction, students work in small groups on a collaborative task matching measurements expressed in decimal and scientific notation. They then match these measurements to everyday objects. </li><li>Students then make comparisons between the objects by investigating the size of one object in relation to another. To end the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students work alone again on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1222"
    ]
  },
  "?taskid=415": {
    "lessons": [
      "download.php?fileid=1226"
    ],
    "title": "Maximizing Area: Gold Rush",
    "objectives": [
      "To help you assess how well students are able to interpret a situation and represent the variables mathematically.",
      "To help you assess how well students are able to select appropriate mathematical methods to use.",
      "To help you assess how well students are able to explore the effects on the area of a rectangle of systematically varying the dimensions whilst keeping the perimeter constant.",
      "To help you assess how well students are able to interpret and evaluate the data generated and identify the optimum case.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Mini-whiteboard, pen and an eraser",
      "Copies of sample responses",
      "Copies of questionnaire",
      "Blank paper",
      "Large sheets of poster paper",
      "Calculators",
      "Rrulers and squared paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/415.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Gold Rush</em> task individually. You then look at their responses and formulate questions for students to think about as they review their work. </li><li>At the start of the lesson, students reflect on their individual responses and use the questions posed to think of ways to improve their work. Next, students work collaboratively in small groups to produce, in the form of a poster, a better solution to the <em>Gold Rush</em> task than they did individually.</li><li>In a whole-class discussion students compare and evaluate the different methods they used.</li><li>Working in small groups, students analyze sample responses to the <em>Gold Rush</em> task, then, in a whole-class discussion, review the methods they have seen. </li><li>Finally, students reflect on their work.</li></ul>"
    ],
    "time": [
      120
    ],
    "resources": [
      "download.php?fileid=1227"
    ]
  },
  "?taskid=416": {
    "lessons": [
      "download.php?fileid=1228"
    ],
    "title": "Using Dimensions: Designing a Sports Bag",
    "objectives": [
      "To help you assess how well students are able to recognize and use common 2D representations of 3D objects.",
      "To help you assess how well students are able to identify and use the appropriate formula for finding the circumference of a circle."
    ],
    "standards": {
      "content": {
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4",
        "MP6"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Copies of sample responses",
      "Large sheets of poster paper and markers",
      "Calculators",
      "Rulers and squared paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/416.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Designing a Sports Bag</em> task individually. You review their work and formulate questions that will help students to improve their solutions. </li><li>At the start of the lesson, students respond individually to the questions set. </li><li>In groups, students combine their thinking and work together to produce a collaborative solution in the form of a poster.</li><li>In the same small groups, students evaluate and comment on some sample responses. They identify the strengths and mistakes in these responses and compare them with their own work.</li><li>In a whole-class discussion, students explain and compare the solution strategies they have seen and used.</li><li>Finally, students reflect on their work and their learning.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1229"
    ]
  },
  "?taskid=419": {
    "lessons": [
      "download.php?fileid=1231"
    ],
    "title": "Proofs of the Pythagorean Theorem",
    "objectives": [
      "To help you assess how well students are able to produce and evaluate geometrical proofs. ",
      "To help you identify and assist students who have difficulties in interpreting diagrams.",
      "To help you identify and assist students who have difficulties in identifying mathematical knowledge relevant to an argument.",
      "To help you identify and assist students who have difficulties in linking visual and algebraic representations.",
      "To help you identify and assist students who have difficulties in producing and evaluating mathematical arguments."
    ],
    "standards": {
      "content": {
        "H.G-SRT": "Prove theorems involving similarity",
        "H.G-CO": "Prove geometric theorems"
      },
      "practices": [
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Grid-paper",
      "Copies of sample responses",
      "Copies of lesson resources",
      "Large sheets of paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/419.png",
    "context": [
      "<ul> <li>Before the lesson, students attempt the assessment task individually. You then review students' work and formulate questions that will help them to improve.</li> <li>The lesson begins with a whole-class discussion of the geometric diagram from the assessment task. Students then work collaboratively on the task, in pairs or threes, to produce a better collective solution than those they produced individually. Throughout their work they justify and explain their decisions to peers. </li> <li>In the same small groups, students critique examples of other students' work. </li> <li>In a whole-class discussion, students explain and evaluate the arguments they have seen and used. </li> <li>Finally, students work alone on a new task similar to the original assessment task. </li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1232"
    ]
  },
  "?taskid=490": {
    "lessons": [
      "download.php?fileid=1368"
    ],
    "title": "Representing and Combining Transformations",
    "objectives": [
      "To help you assess how well students are able to recognize and visualize transformations of 2D shapes.",
      "To help you assess how well students are able to translate, reflect and rotate shapes, and combine these transformations.",
      "To encourage discussion on some common misconceptions about transformations."
    ],
    "standards": {
      "content": {
        "8.G": "Understand congruence and similarity using physical models, transparencies, or geometry software."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP5"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Map pin or thumbtack",
      "Cut-up copy of card sets",
      "Mini-whiteboard, pen and an eraser",
      "Overhead projector (optional)",
      "Copies of lesson resources",
      "Eraser",
      "Glue stick",
      "Large sheets of paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/490.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work, and create questions for students to consider in order to improve their solutions.</li><li>After a whole-class introduction, students work in small groups on a collaborative task. </li><li>In a whole-class discussion, students review the main mathematical concepts of the lesson.</li><li>Students return to their original task, and try to improve their own responses.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1369"
    ]
  },
  "?taskid=492": {
    "lessons": [
      "download.php?fileid=1372"
    ],
    "title": "Identifying Similar Triangles",
    "objectives": [
      "To help you assess how students reason about geometry.",
      "To help you assess how well students are able to use facts about the angle sum and exterior angles of triangles to calculate missing angles.",
      "To help you assess how well students are able to apply angle theorems to parallel lines cut by a transversal.",
      "To help you assess how well students are able to interpret geometrical diagrams using mathematical properties to identify similarity of triangles."
    ],
    "standards": {
      "content": {
        "8.G": "Understand congruence and similarity using physical models, transparencies, or geometry software."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Pencils and markers",
      "Copies of lesson resources",
      "Pair of scissors",
      "Glue stick",
      "Llarge sheets of paper",
      "Blank cards"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/492.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and ability to reason using geometrical properties. You then review their responses and create questions for students to consider when improving their work. </li><li>After a whole-class introduction, students work in small groups on a collaborative discussion task, categorizing diagrams of pairs of triangles based on their similarity. Throughout their work, students justify and explain their thinking and reasoning.</li><li>Students review their work by comparing their categorizations with those of their peers. </li><li>In a whole-class discussion, students review their work and discuss what they have learned.</li><li>In a follow-up lesson, students review their initial work on the assessment task and work alone on a task similar to the introductory task. </li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1373"
    ]
  },
  "?taskid=493": {
    "lessons": [
      "download.php?fileid=1374"
    ],
    "title": "Generalizing Patterns: The Difference of Two Squares",
    "objectives": [
      "To help you assess how well students working with square numbers are able to choose an appropriate, systematic way to collect and organize data, examining the data for patterns.",
      "To help you assess how well students working with square numbers are able to describe and explain findings clearly and effectively.",
      "To help you assess how well students working with square numbers are able to generalize using numerical, geometrical, graphical and/or algebraic structure.",
      "To help you assess how well students working with square numbers are able to explain why certain results are possible/impossible, moving towards a proof."
    ],
    "standards": {
      "content": {
        "8.EE": "Work with radicals and integer exponents.",
        "8.F": "Use functions to model relationships between quantities."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Blank paper",
      "Copies of questionnaire",
      "Copies of sample repsonses",
      "Large sheets of poster paper and felt-tipped pens",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/493.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You review their responses and create questions for them to consider when improving their work.</li><li>At the start of the lesson, students reflect on their individual responses and use the questions posed to think of ways to improve their work. They then work collaboratively in small groups to produce, in the form of a poster, a better solution to the task than they did individually.</li><li>In a whole-class discussion students compare and evaluate the different strategies they have used.</li><li>Working in the same small groups, students analyze sample responses to the task.</li><li>In a whole-class discussion, students review the methods they have seen.</li><li>At the end of the lesson, or in a follow-up lesson, students reflect individually on their work.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1375"
    ]
  },
  "?taskid=494": {
    "lessons": [
      "download.php?fileid=1376"
    ],
    "title": "Drawing to Scale: Designing a Garden",
    "objectives": [
      "To help assess how well students are able to interpret and use scale drawings to plan a garden layout. This involves using proportional reasoning and metric units."
    ],
    "standards": {
      "content": {
        "7.EE": "Solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume.",
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems."
      },
      "practices": [
        "MP2",
        "MP4",
        "MP5"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Mini-whiteboard, pen and an eraser",
      "Copies of questionnaire",
      "Copies of sample repsonses",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper and felt-tipped pens"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/494.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current levels of understanding. You review their responses and create questions to help them improve their work.</li><li>At the start of the lesson, students reflect on their individual responses and use your questions to improve their work. They then work in small groups to analyze sample responses, and then produce an improved solution to their own work. They then review the methods they have used.</li><li>In a follow-up lesson, students reflect on their work. If there is time, a further task is available.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1377"
    ]
  },
  "?taskid=547": {
    "lessons": [
      "download.php?fileid=1452"
    ],
    "title": "Manipulating Radicals",
    "objectives": [
      "To help you assess how well students are able to use the properties of exponents, including rational exponents, and manipulate algebraic statements involving radicals.",
      "To help you assess how well students are able to discriminate between equations and identities.",
      "To consider the role of the imaginary number, but this is optional."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Write expressions in equivalent forms to solve problems",
        "H.N-CN": "Use complex numbers in polynomial identities and equations.",
        "H.N-RN": "Extend the properties of exponents to rational exponents"
      },
      "practices": [
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Pair of scissors",
      "Projector (optional)",
      "Overhead projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current levels of understanding. You review their work and create questions to help students improve their solutions.</li><li>During the lesson, students first work in small groups on a collaborative discussion task.</li><li>After sharing their solutions with another group, students extend and generalize the math.</li><li>An optional collaborative task focuses on imaginary numbers.</li><li>During a whole-class discussion, students review the main mathematical concepts of the lesson.</li><li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1453"
    ]
  },
  "?taskid=425": {
    "lessons": [
      "download.php?fileid=1247"
    ],
    "title": "Equations of Circles 2",
    "objectives": [
      "To help you assess how well students are able to translate between the equations of circles and their geometric features.",
      "To help you assess how well students are able to sketch a circle from its equation."
    ],
    "standards": {
      "content": {
        "H.G-GMD": "Explain volume formulas and use them to solve problems",
        "H.N-RN": "Extend the properties of exponents to rational exponents",
        "H.A-CED": "Create equations that describe numbers or relationships"
      },
      "practices": [
        "MP1",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/425.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>During the lesson, students work in small groups on a collaborative task, categorizing equations and geometric descriptions of circles.</li><li>Towards the end of the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students review their initial solutions to the assessment task, and then use what they have learned to either revise the same task or complete a different task. </li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1248"
    ]
  },
  "?taskid=424": {
    "lessons": [
      "download.php?fileid=1245"
    ],
    "title": "Rational and Irrational Numbers 1",
    "objectives": [
      "To help you assess how well students are able to distinguish between rational and irrational numbers.",
      "To help you identify and assist students who have difficulties in classifying numbers as rational or irrational.",
      "To help you identify and assist students who have difficulties in moving between different representations of rational and irrational numbers."
    ],
    "standards": {
      "content": {
        "H.N-RN": "Use properties of rational and irrational numbers."
      },
      "practices": [
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of the task sheet",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Scrap paper",
      "Pair of scissors",
      "Sticky notes and marker pens",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/424.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the assessment task individually. You then review students' work and formulate questions that will help them improve their solutions.</li><li>The lesson is introduced in a whole-class discussion. Students then work collaboratively in pairs or threes to make a poster on which they classify numbers as rational and irrational. They work with another group to compare and check solutions. Throughout their work students justify and explain their decisions to peers. </li><li>In a whole-class discussion, students revisit some representations of numbers that could be either rational or irrational and compare their classification decisions. </li><li>Finally, students work individually to show their learning using a second assessment task.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1246"
    ]
  },
  "?taskid=427": {
    "lessons": [
      "download.php?fileid=1252"
    ],
    "title": "Ferris Wheel",
    "objectives": [
      "To help you assess how well students are able to model a periodic situation, the height of a person on a Ferris wheel, using trigonometric functions.",
      "To help you assess how well students are able to interpret the constants <em>a, b, c</em> in the formula <em>h = a + b cos ct </em>in terms of the physical situation, where <em>h</em> is the height of the person above the ground and <em>t</em> is the elapsed time."
    ],
    "standards": {
      "content": {
        "H.F-BF": "Build new functions from existing functions",
        "H.F-TF": "Extend the domain of trigonometric functions using the unit circle"
      },
      "practices": [
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Scientific calculator",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Pair of scissors",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/427.png",
    "context": [
      "<ul><li>It is helpful if students have met graphs of the sine and cosine functions before this lesson unit. </li><li>Before the lesson, students attempt the assessment task individually. You then review their work and formulate questions for students to answer in order for them to improve their work.</li> <li>During the lesson, students engage in collaborative discussion in pairs or threes on a related task. They regroup to assess each other's work. Throughout their work they justify and explain their decisions to peers. In a whole-class discussion, students explain and extend their solutions and methods. </li> <li>Finally, students again work alone on a task similar to the assessment task. </li> </ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1253"
    ]
  },
  "?taskid=426": {
    "lessons": [
      "download.php?fileid=1250"
    ],
    "title": "Comparing Investments",
    "objectives": [
      "To help you assess how well students are able to interpret exponential and linear functions.",
      "To identify and help students who have the following difficulties translating between descriptive, algebraic and tabular data, and graphical representation of the functions.",
      "To identify and help students who have the following difficulties tecognizing how, and why, a quantity changes per unit interval."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Write expressions in equivalent forms to solve problems",
        "H.F-LE": "Interpret expressions for functions in terms of the situation they model"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Calculator",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Marker, glue stick, pair of scissors, Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/426.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on the assessment task <em>Making Money?</em> designed to reveal their current understanding and difficulties working with linear and exponential functions. You then review their responses and create questions for students to consider, to help them improve their work.</li><li>After a whole-class interactive introduction, students work in small groups on a series of collaborative card matching tasks.</li><li>In a whole-class discussion, students review the main mathematical concepts of the lesson and the strategies used.</li><li>Students then return to the original task, consider their own responses and the questions posed, and use what they have learned to complete a similar task.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1251"
    ]
  },
  "?taskid=421": {
    "lessons": [
      "download.php?fileid=1237"
    ],
    "title": "Repeating Decimals",
    "objectives": [
      "To help you assess how well students are able to translate between decimal and fraction notation, particularly when the decimals are repeating.",
      "To help you assess how well students are able to create and solve simple linear equations to find the fractional equivalent of a repeating decimal.",
      "To help you assess how well students are able to understand the effect of multiplying a decimal by a power of 10."
    ],
    "standards": {
      "content": {
        "8.NS": "Know that there are numbers that are not rational, and approximate them by rational numbers.",
        "8.EE": "Analyze and solve linear equations and pairs of simultaneous linear equations."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP6"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Calculator",
      "Mini-whiteboard, pen and an eraser",
      "Copies of card sets",
      "Glue stick",
      "Large sheets of poster paper",
      "Projector (optional)",
      "Overhead projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/421.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Repeating Decimals</em> task individually. You review their work and write questions for students to answer in order to improve their solutions. </li><li>A whole-class discussion is used to introduce students to some of the patterns in repeating decimals and a method for converting such decimals to fractions.</li><li>Students work collaboratively in small groups on a matching task that requires them to translate between fractions, decimals, and equations. </li><li>In a final whole-class discussion, students compare and evaluate the methods they have seen and used. </li><li>In a follow-up lesson, students review their initial solutions and then complete a different <em>Repeating Decimals </em>task. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1238"
    ]
  },
  "?taskid=420": {
    "lessons": [
      "download.php?fileid=1234"
    ],
    "title": "Devising a Measure for Correlation",
    "objectives": [
      "To help you assess how well students understand the notion of correlation.",
      "To identify and help students who have difficulty in understanding correlation as the degree of fit between two variables.",
      "To identify and help students who have difficulty in making a mathematical model of a situation.",
      "To identify and help students who have difficulty in testing and improving the model.",
      "To identify and help students who have difficulty in communicating their reasoning clearly.",
      "To identify and help students who have difficulty in evaluating alternative models of the situation."
    ],
    "standards": {
      "content": {
        "H.S-ID": "Summarize, represent, and interpret data on two categorical and  quantitative variables "
      },
      "practices": [
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Copies of sample responses",
      "Copies of lesson resources",
      "Calculators",
      "Glue stick",
      "Large sheets of poster paper and felt-tipped pens",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/420.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task <em>Drive-in Movie Theater</em> that is designed to reveal their current understanding and difficulties. You then review their work and create questions for students to answer in order to improve their methods.</li><li>At the start of the lesson, students work alone answering your questions about the same problem, then work collaboratively in small groups to produce, in the form of a poster, a better solution to the task <em>Drive-in Movie Theater</em>, than they did individually.</li><li>In a whole-class discussion students compare and evaluate the different methods they have used.</li><li>Working in the same small groups, students analyze sample responses to the task.</li><li>In a whole-class discussion students explain and compare the alternative methods.</li><li>Finally, students review what they have learnt.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1235",
      "download.php?fileid=1236",
      "download.php?fileid=1236"
    ]
  },
  "?taskid=423": {
    "lessons": [
      "download.php?fileid=1243"
    ],
    "title": "Representing Data 2: Using Box Plots",
    "objectives": [
      "To help you assess how well students are able to interpret data using frequency graphs and box plots. In particular this unit aims to identify and help students who have difficulty figuring out the data points and spread of data from frequency graphs and box plots. It is advisable to use the lesson: <em>Representing Data 1: Frequency Graphs, </em>before this one."
    ],
    "standards": {
      "content": {
        "H.S-ID": "Summarize, represent, and interpret data on a single count or measurement variable"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Ruler",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of card sets",
      "Glue stick",
      "Large sheets of poster paper",
      "Projector (optional)",
      "Overhead projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/423.png",
    "context": [
      "<ul> <li>Before the lesson, students individually complete an assessment task that is designed to reveal their current understanding and difficulties. </li> <li>A whole-class introduction gives guidance to students on how to work during the collaborative activity.</li> <li>Students then work in pairs or threes on a collaborative discussion task, matching frequency graphs to box plots.</li> <li>Towards the end of the lesson there is another whole-class discussion.</li> <li>In a follow-up, lesson students work alone on a similar task to the introductory assessment task.</li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1244"
    ]
  },
  "?taskid=422": {
    "lessons": [
      "download.php?fileid=1239"
    ],
    "title": "Estimating: Counting Trees",
    "objectives": [
      "To help you assess how well students are able to solve simple problems involving ratio and direct proportion.",
      "To help you assess how well students are able to choose an appropriate sampling method.",
      "To help you assess how well students are able to collect discrete data and record them using a frequency table."
    ],
    "standards": {
      "content": {
        "7.SP": "Use random sampling to draw inferences about a population.",
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems.",
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4",
        "MP5"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Copies of questionnaires",
      "Copies of lesson resources",
      "Glue stick",
      "Large sheets of poster paper",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/422.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Counting Trees</em> task individually. You then assess their responses, and formulate questions that will prompt students to review their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the <em>Counting Trees</em> task, in the form of a poster. </li><li>Working in the same small groups, students evaluate and comment on sample responses, identifying the strengths and mistakes in these responses and comparing them with their own work.</li><li>In a whole-class discussion, students compare and evaluate the methods they have seen and used. </li><li>Finally, students reflect on their work and their learning.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1240"
    ]
  },
  "?taskid=429": {
    "lessons": [
      "download.php?fileid=1257"
    ],
    "title": "Solving Geometry Problems: Floodlights",
    "objectives": [
      "To help you assess how well students are able to identify and use geometrical knowledge to solve a problem.",
      "To identify and help students who have difficulty in making a mathematical model of a geometrical situation.",
      "To identify and help students who have difficulty in drawing diagrams to help with solving a problem.",
      "To identify and help students who have difficulty in identifying similar triangles and using their properties to solve problems.",
      "To identify and help students who have difficulty in tracking and reviewing strategic decisions when problem-solving."
    ],
    "standards": {
      "content": {
        "H.G-SRT": "Prove theorems involving similarity",
        "H.G-CO": "Prove geometric theorems"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4",
        "MP5",
        "MP7"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Copies of questionnaires",
      "Copies of lesson resources",
      "Large sheets of poster paper",
      "Squared and plain paper",
      "Copies of sample responses",
      "Rulers, pencils, protractors",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/429.png",
    "context": [
      "<ul><li>Before the lesson, students attempt an assessment task individually. You review their work, and formulate questions to help them improve their solution. </li><li>During the lesson, students first work individually, using your questions, to improve their solutions. </li><li>They then work collaboratively in pairs or threes on the same task. They justify and explain their decisions to peers. Working in the same small groups, they critique examples of other students' work on the task. </li><li>In a whole-class discussion, students explain and compare the alternative approaches they have seen and used. Finally, they again work individually to reflect on their solutions to the task. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1258"
    ]
  },
  "?taskid=428": {
    "lessons": [
      "download.php?fileid=1254"
    ],
    "title": "Modeling: Rolling Cups",
    "objectives": [
      "To help you assess how well students are able to choose appropriate mathematics to solve a non-routine problem.",
      "To help you assess how well students are able to generate useful data by systematically controlling variables.",
      "To help you assess how well students are able to develop experimental and analytical models of a physical situation."
    ],
    "standards": {
      "content": {
        "H.G-MG": "Apply geometric concepts in modeling situations",
        "H.G-GMD": "Visualize relationships between two-dimensional and three- dimensional objects",
        "H.F-BF": "Build a function that models a relationship between two quantities",
        "H.G-SRT": "Prove theorems involving similarity"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of task sheets",
      "Copies of sample responses",
      "Large sheets of poster paper and felt-tipped pens",
      "Paper and plastic cups",
      "Rulers",
      "Scrap paper",
      "Graph paper",
      "Protractors",
      "String",
      "Chalk",
      "Glue stick",
      "Scissors",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/428.png",
    "context": [
      "<ul> <li>Before the lesson, students watch a video of <em>Rolling Cups</em>. They then work on the <em>Rolling Cups</em> scenario in a task designed to assess their current approaches to modeling. You collect and review students' work and write questions to help improve their models. </li> <li>During the lesson, students first work individually to review their initial work. They then work in pairs to compare their approaches to the task. Collaboratively, they choose a strategy that will produce an improved model and together implement that strategy. Students next review <em>Sample Solutions</em> to the task. This is followed by a whole-class discussion in which students identify the strengths and weaknesses of different approaches to the modeling task. </li> <li>After the lesson, students review their work on the task. </li> </ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1255",
      "http://map.mathshell.org/lesson_support/rolling_cups.htm",
      "http://map.mathshell.org/lesson_support/rolling_cups.htm"
    ]
  },
  "?taskid=207": {
    "lessons": [
      "download.php?fileid=1241"
    ],
    "title": "Optimization Problems: Boomerangs",
    "objectives": [
      "To help you assess how well students are able to interpret a situation and represent the constraints and variables mathematically. ",
      "To help you assess how well students are able to select appropriate mathematical methods to use.",
      "To help you assess how well students are able to explore the effects of systematically varying the constraints.",
      "To help you assess how well students are able to interpret and evaluate the data generated and identify the optimum case, checking it for confirmation.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "H.A-REI": "Represent and solve equations and inequalities graphically.",
        "H.A-CED": "Create equations that describe numbers or relationships"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Calculators",
      "Copy of assessment task",
      "Copies of sample responses",
      "Graph paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/207.png",
    "context": [
      "<ul><li>This lesson is designed to help students develop strategies for solving optimization problems. Such problems typically involve scenarios where limited resources must be used to greatest effect, as in, for example, the allocation of time and materials to maximize profit.</li><li>Before the lesson, students attempt the problem individually. You then review their work and formulate questions for students to answer in order to improve their solutions.</li> <li>At the start of the lesson, students work alone answering your questions about the same problem.</li> <li>Students are then grouped, and engage in a collaborative discussion of the same task. </li> <li>In the same small groups, students are given sample solutions to comment on and evaluate.</li> <li>In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li> <li>Finally, students revise their individual solutions, and comment on what they have learned.</li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1242"
    ]
  },
  "?taskid=439": {
    "lessons": [
      "download.php?fileid=1280"
    ],
    "title": "2D Representations of 3D Objects",
    "objectives": [
      "To help you assess how well students are able to visualize two-dimensional cross-sections of representations of three-dimensional objects. In particular, the lesson will help you identify and help students who have difficulties recognizing and drawing two-dimensional cross-sections at different points along a plane of a representation of a three-dimensional object."
    ],
    "standards": {
      "content": {
        "H.G-GMD": "Visualize relationships between two-dimensional and three- dimensional objects"
      },
      "practices": [
        "MP3",
        "MP5",
        "MP6",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up cards of lesson cards",
      "Copies of lesson resources",
      "Large sheets of poster paper",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/439.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You review their solutions and create questions for students to consider, to help improve their work.</li><li>During the lesson, students work in groups on a collaborative activity. They match representations of three-dimensional objects with two-dimensional cross-sections. Students then share their work with another group.</li><li>In a whole-class discussion, students compare and evaluate the methods they have seen and used. </li><li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task. </li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1281"
    ]
  },
  "?taskid=432": {
    "lessons": [
      "download.php?fileid=1512"
    ],
    "title": "Solving Quadratic Equations: Cutting Corners",
    "objectives": [
      "To help you assess how well students are able to solve quadratics in one variable.",
      "To help you identify and help students who have the difficulty of making sense of a real life situation and deciding on the math to apply to the problem.",
      "To help you identify and help students who have the difficulty of solving quadratic equations by taking square roots, completing the square, using the quadratic formula, and factoring.",
      "To help you identify and help students who have the difficulty of interpreting results in the context of a real life situation."
    ],
    "standards": {
      "content": {
        "H.G-MG": "Apply geometric concepts in modeling situations",
        "H.A-REI": "Solve equations and inequalities in one variable",
        "H.G-SRT": "Define trigonometric ratios and solve problems involving right triangles"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the task",
      "Copies of the questionnaire",
      "Calculators",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/432.png",
    "context": [
      "<ul><li>Before the lesson students attempt the problem individually. You then review their work and write questions for students to answer to help them improve their solutions.</li><li>At the start of the lesson, students work alone, answering your questions. </li><li>Students are then grouped, and work collaboratively on the same task. </li><li>In the same small groups, students are given some sample solutions to comment on and evaluate.</li><li>In a whole-class discussion, students explain and compare the different solution strategies they have seen and used.  </li><li>Finally, students review what they have learned.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1513"
    ]
  },
  "?taskid=433": {
    "lessons": [
      "download.php?fileid=1265"
    ],
    "title": "Solving Real-Life Problems: Baseball Jerseys",
    "objectives": [
      "To help you assess how well students are able to interpret a situation and represent the variables mathematically.",
      "To help you assess how well students are able to select appropriate mathematical methods to use.",
      "To help you assess how well students are able to explore the effects of systematically varying the constraints.",
      "To help you assess how well students are able to interpret and evaluate the data generated and identify the break-even point, checking it for confirmation.",
      "To help you assess how well students are able to communicate their reasoning clearly."
    ],
    "standards": {
      "content": {
        "8.EE": "Analyze and solve linear equations and pairs of simultaneous linear equations."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Blank paper",
      "Mini-whiteboard, pen and an eraser",
      "Copies of the questionnaire",
      "Calculators",
      "Large sheets of poster paper and felt-tipped pens",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/433.png",
    "context": [
      "<ul><li>Before the lesson students attempt the <em>Baseball Jerseys</em> task individually. You then review their responses and formulate questions for them to consider when thinking about how they could improve their work.</li><li>At the start of the lesson, students think individually about the questions posed.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the <em>Baseball Jerseys</em> task, in the form of a poster. </li><li>In the same small groups, students evaluate and comment on sample responses, identifying the strengths and weaknesses in these responses and comparing them with their own work.</li><li>In a whole-class discussion students compare and evaluate the strategies they have seen and used. </li><li>In a follow-up lesson, students spend ten minutes reflecting on their work and what they have learned.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1266"
    ]
  },
  "?taskid=430": {
    "lessons": [
      "download.php?fileid=1259"
    ],
    "title": "Functions and Everyday Situations",
    "objectives": [
      "To help you assess how well students are able to articulate verbally the relationships between variables arising in everyday contexts.",
      "To help you assess how well students are able to translate between everyday situations and sketch graphs of relationships between variables.",
      "To help you assess how well students are able to interpret algebraic functions in terms of the contexts in which they arise.",
      "To help you assess how well students are able to reflect on the domains of everyday functions and in particular whether they should be discrete or continuous."
    ],
    "standards": {
      "content": {
        "H.F-IF": "Analyze functions using different representations",
        "H.F-LE": "Interpret expressions for functions in terms of the situation they model"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4",
        "MP5"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Graphing calculators",
      "Projector (optional)",
      "Overhead projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/430.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to consider that may help them improve their work.</li><li>During the lesson, small groups work on a collaborative task, matching situations, sketch graphs, and algebraic functions. They also refine the graphs and interpret the formulas to answer questions. </li><li>In a whole-class discussion, students discuss what has been learned and the strategies used.</li><li>In a follow-up lesson, students return to their original task to consider their responses and the questions posed, and use what they have learned to complete a similar task; <em>Another Four Situations</em>.</li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1260"
    ]
  },
  "?taskid=431": {
    "lessons": [
      "download.php?fileid=1261"
    ],
    "title": "Steps to Solving Equations",
    "objectives": [
      "To help you assess how well students are able to form and solve linear equations involving factorizing and using the distributive law.",
      "To help you identify and assist students who have difficulties in using variables to represent quantities in a real-world or mathematical problem.",
      "To help you identify and assist students who have difficulties in solving word problems leading to equations of the form px + q = r and p(x + q) = r."
    ],
    "standards": {
      "content": {
        "7.EE": "Solve real-life and mathematical problems using numerical and algebraic expressions and equations."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/431.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the assessment task individually. You then review students' responses and formulate questions that will help them improve their work.</li><li>During the lesson, students work collaboratively in pairs or threes, matching equations to stories and then ordering the steps used to solve these equations. Throughout their work, students explain their reasoning to their peers. </li><li>Finally, students again work individually to review their work and attempt a second task, similar to the initial assessment task. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1262"
    ]
  },
  "?taskid=209": {
    "lessons": [
      "download.php?fileid=669"
    ],
    "title": "Solving Linear Equations in Two Variables",
    "objectives": [
      "To help you assess how well students are able to formulate and solve problems using algebra.",
      "To identify and help students who have the difficulties solving a problem using two linear equations with two variables.",
      "To identify and help students who have the difficulties interpreting the meaning of algebraic expressions."
    ],
    "standards": {
      "content": {
        "H.A-REI": "Solve systems of equations.",
        "H.A-CED": "Create equations that describe numbers or relationships"
      },
      "practices": [
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Blank sheets of paper",
      "Copies of assessment task",
      "Graph-paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/209.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on the assessment task <em>Notebooks and Pens</em>. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>During the lesson, students work individually on a task that requires them to interpret and solve two equations in two variables. Students then compare and discuss their solutions in small groups.</li><li>In the same small groups, students evaluate some sample solutions of the same task.</li><li>In a whole-class discussion, students explain and compare the alternative solution strategies they have seen and used. </li><li>Finally, students use what they have learned to revise their work on <em>Notebooks and Pens</em>.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=670"
    ]
  },
  "?taskid=437": {
    "lessons": [
      "download.php?fileid=1273"
    ],
    "title": "Manipulating Polynomials",
    "objectives": [
      "To help you assess how well students are able to manipulate and calculate with polynomials.",
      "To identify and help students who have difficulties in switching between visual and algebraic representations of polynomial expressions.",
      "To identify and help students who have difficulties in performing arithmetic operations on algebraic representations of polynomials, factorizing and expanding appropriately when it helps to make the operations easier."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Interpret the structure of expressions",
        "H.A-APR": "Perform arithmetic operations on polynomials"
      },
      "practices": [
        "MP2",
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Copies of assessment task",
      "Cut-up card-sets",
      "Poster papers",
      "Glue sticks",
      "Pencils",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/437.png",
    "context": [
      "<ul><li>In this lesson students make connections between representations, clear parentheses, simplify, factorize, and use the arithmetic of polynomials in a purposive context.</li><li>Before the lesson students work individually on the assessment task <em>Sequences and Equations. </em>You review their responses and create questions for students to consider, to help improve their work. <em></em></li><li>You introduce the lesson by showing students how the card matching activity works. Students then work collaboratively in small groups to match diagrammatic and algebraic representations of polynomials. They display their work on posters. <em></em></li><li>Students share their finished posters, comparing reasoning, and checking that explanations are clear and complete.<em></em></li><li>In a whole-class discussion, you reflect on the strategies students have used to complete the task.<em></em></li><li>Students then work individually, to review their solutions to the initial assessment task before completing a second task, <em>Sequences and Equations (revisited)</em>. <em></em></li></ul>"
    ],
    "time": [
      65
    ],
    "resources": [
      "download.php?fileid=1274"
    ]
  },
  "?taskid=434": {
    "lessons": [
      "download.php?fileid=1267"
    ],
    "title": "Rational and Irrational Numbers 2",
    "objectives": [
      "To help you assess how well students reason about the properties of rational and irrational numbers.",
      "To help you identify and assist students who have difficulties in finding irrational and rational numbers to exemplify general statements.",
      "To help you identify and assist students who have difficulties in reasoning with properties of rational and irrational numbers."
    ],
    "standards": {
      "content": {
        "H.N-RN": "Use properties of rational and irrational numbers."
      },
      "practices": [
        "MP3"
      ]
    },
    "materials": [
      "Copies of the review tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Large sheets of poster paper",
      "Scissors",
      "Glue sticks",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/434.png",
    "context": [
      "<ul> <li>Before the lesson, students attempt the assessment task individually. You review students' work and formulate questions that will help them improve their solutions.</li> <li>During the lesson, students work collaboratively in small groups, reasoning about general statements on rational and irrational numbers. Then, in a whole class-discussion, students explain and compare different justifications they have seen and used for making their classification decisions. </li> <li>Finally, students again work alone to improve their individual solutions to the assessment task.</li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1268"
    ]
  },
  "?taskid=226": {
    "lessons": [
      "download.php?fileid=703"
    ],
    "title": "Finding Equations of Parallel and Perpendicular Lines",
    "objectives": [
      "To help you assess how well students are able to understand the relationship between the slopes of parallel and perpendicular lines.",
      "To help identify students who find it difficult to find, from their equations, lines that are parallel and perpendicular.",
      "To help identify students who find it difficult to identify and use intercepts.",
      "It also aims to encourage discussion on some common misconceptions about equations of lines."
    ],
    "standards": {
      "content": {
        "H.G-GPE": "Use coordinates to prove simple geometric theorems algebraically"
      },
      "practices": [
        "MP1",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/226.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current levels of understanding and their difficulties. You then review their work, and create questions for students to answer in order to improve their solutions.</li><li>During the lesson, students work in small groups on a task related to the assessment task. Next, they re-group to critique each other's work. Throughout this work they justify and explain their decisions to each other. </li><li>In a whole-class discussion, students explain and extend their methods and solutions.</li><li>Finally, students again work individually to improve their solutions to the assessment task.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=704"
    ]
  },
  "?taskid=603": {
    "lessons": [
      "download.php?fileid=1579"
    ],
    "title": "Modeling: Hot or Cold",
    "objectives": [
      "To help students judge the accuracy of two different approximations to a particular linear relationship. Students will compare two linear functions as approximations to the relationship between Celsius and Fahrenheit temperature and consider under what circumstances each of the approximations may be reasonable."
    ],
    "standards": {
      "content": {
        "<a class=\"standardcode\" href=\"stds.php?id=1588\" title=\"Expressions and Equations\">7.EE</a>": "Expressions and Equations"
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Graph paper and rulers",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students tackle the problem individually. You review their solutions and write questions to help students improve their work.</li><li>At the beginning of the lesson, students respond to your questions. Students are then grouped into pairs or threes and work collaboratively to produce a better solution to the same task.</li><li>There is a whole-class discussion to compare and evaluate different approaches.</li><li>This is followed by a second collaborative activity in which students work in small groups to evaluate and comment on sample solutions, followed by a second whole-class discussion about the work.</li><li>Finally, students review and evaluate their work on the problem.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1576"
    ]
  },
  "?taskid=602": {
    "lessons": [
      "download.php?fileid=1580"
    ],
    "title": "Evaluating Statements About Number Operations",
    "objectives": [
      "To help you assess how well students are able to understand the properties of number operations.",
      "To help you assess how well students are able to substitute integers, fractions, decimals, and negative numbers into inequality statements in order to test their validity.",
      "To help you assess how well students are able to represent inequalities algebraically and in words."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of numbers to the system of rational numbers.",
        "6.EE": "Reason about and solve one-variable equations and inequalities."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work in small groups on a collaborative task,</li><li>describing inequalities algebraically and in words.</li><li>In the same small groups, students match number line representations to their categorized statements, showing when the statements are true.</li><li>To end the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students work alone again on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1574"
    ]
  },
  "?taskid=604": {
    "lessons": [
      "download.php?fileid=1577"
    ],
    "title": "Interpreting and Using a Graph: Taxi Fares",
    "objectives": [
      "To help you assess how well students are able to select and use mathematical ideas to solve a problem and then compare and critique alternative approaches. The lesson presents students with a distance-time scatter plot representing journeys made by a taxi cab. They use this to decide upon a suitable rate at which the driver should charge passengers."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of numbers to the system of rational numbers.",
        "6.EE": "Reason about and solve one-variable equations and inequalities."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Plain or squared paper",
      "Calculators and graph paper",
      "Large sheets of poster paper",
      "Copies of sample responses",
      "Post-it notes",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Taxi Fares</em> task individually. You then assess their responses and formulate questions that will prompt students to review their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the Taxi Fares task, in the form of a poster.</li><li>Working in the same small groups, students evaluate, comment on and complete sample responses. In a whole-class discussion students compare and evaluate the methods they have seen and used.</li><li>In a follow-up lesson, students reflect on their work and what they have learned.</li></ul>"
    ],
    "time": [
      85
    ],
    "resources": [
      "download.php?fileid=1578"
    ]
  },
  "?taskid=442": {
    "lessons": [
      "download.php?fileid=1286"
    ],
    "title": "Solving Linear Equations in One Variable",
    "objectives": [
      "To help you assess how well students are able to solve linear equations in one variable with rational number coefficients.",
      "To help you assess how well students are able to collect like terms.",
      "To help you assess how well students are able to expand expressions using the distributive property.",
      "To help you assess how well students are able to categorize linear equations in one variable as having one, none, or infinitely many solutions.",
      "To encourage discussion on some common misconceptions about algebra."
    ],
    "standards": {
      "content": {
        "8.EE": "Analyze and solve linear equations and pairs of simultaneous linear equations."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper, pencils and markers",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/442.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their responses and create questions for students to consider when improving their work.s</li><li>After a whole-class introduction, students work in small groups on a collaborative discussion task, categorizing equations based on the number of solutions. Throughout their work, students justify and explain their thinking and reasoning.</li><li>In the same small groups, students critique the work of others and then discuss as a whole class what they have learned.</li><li>Finally, students return to their original task and try to improve their own, individual responses.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1287"
    ]
  },
  "?taskid=441": {
    "lessons": [
      "download.php?fileid=1284"
    ],
    "title": "Sectors of Circles",
    "objectives": [
      "To help you assess how well students are able to solve problems involving area and arc length of a sector of a circle using radians. It assumes familiarity with radians and should not be treated as an introduction to the topic.",
      "To help you identify and assist students who have difficulties in computing perimeters, areas, and arc lengths of sectors using formulas.",
      "To help you identify and assist students who have difficulties in finding the relationships between arc lengths, and areas of sectors after scaling."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Interpret the structure of expressions",
        "H.G-C": "Find arc lengths and areas of sectors of circles"
      },
      "practices": [
        "MP1",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/441.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to consider, in order to improve their work.</li><li>During the lesson, small groups work on a collaborative task, in which they match cards according to the arc length, area, or perimeter of the sectors.</li><li>After considering in the same small groups the general results of changing the radius and/or sector angle of a sector, there is a whole-class discussion.</li><li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task. </li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1515"
    ]
  },
  "?taskid=440": {
    "lessons": [
      "download.php?fileid=1282"
    ],
    "title": "Lines and Linear Equations",
    "objectives": [
      "To help you assess how well students are able to interpret speed as the slope of a linear graph.",
      "To help you assess how well students are able to translate between the equation of a line and its graphical representation."
    ],
    "standards": {
      "content": {
        "8.EE": "Understand the connections between proportional relationships, lines, and linear equations.",
        "8.F": "Use functions to model relationships between quantities."
      },
      "practices": [
        "MP2",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Graph paper and rulers",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/440.png",
    "context": [
      "<ul> <li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li> <li>During the lesson, students work in small groups on a collaborative task, matching graphs, equations and pictures.</li> <li>Towards the end of the lesson there is a whole-class discussion.</li> <li>In a follow-up lesson, students review their initial solutions, and then use what they have learned to either revise the same introductory assessment task or complete a different task. </li> </ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1283"
    ]
  },
  "?taskid=524": {
    "lessons": [
      "download.php?fileid=1538"
    ],
    "title": "Transforming 2D Figures",
    "objectives": [
      "To help you assess how well students are able to describe in words the transformation that maps an object to a transformed image.",
      "To help you assess how well students are able to given a geometric figure and a rotation, reflection or  translation, draw the transformed figure (or the original figure if the  image is given.)",
      "To help you assess how well students are able to describe transformations as algebraic functions that take points in the plane as inputs and give other points as outputs."
    ],
    "standards": {
      "content": {
        "H.G-CO": "Experiment with transformations in the plane"
      },
      "practices": [
        "MP1",
        "MP6",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Tracing paper",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment  task that is designed to reveal their current understanding and  difficulties. You then review their solutions and create questions for students to consider in order to improve their work. These are returned after the lesson.</li><li>After a whole-class introduction students work in small groups on a  collaborative task, describing transformations and completing either  the transformed image or original figure for a given transformation. </li><li>After a final whole-class discussion, students work individually either on a new assessment task, or return to the original task and try to improve their responses.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=1539"
    ]
  },
  "?taskid=456": {
    "lessons": [
      "download.php?fileid=1306"
    ],
    "title": "Developing a Sense of Scale",
    "objectives": [
      "To help you assess whether students recognize relationships of direct proportion and how well they solve problems that involve proportional reasoning.",
      "To help you identify those students who use inappropriate additive strategies in scaling problems, which have a multiplicative structure.",
      "To help you identify those students who rely on piecemeal and inefficient strategies such as doubling, halving, and decomposition, and have not developed a single multiplier strategy for solving proportionality problems.",
      "To help you identify those students who  see multiplication as making numbers bigger, and division as making numbers smaller."
    ],
    "standards": {
      "content": {
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems."
      },
      "practices": [
        "MP2",
        "MP8"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Tracing paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/456.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current levels of understanding and difficulties. You review their solutions and write questions to help students improve their work. </li><li>During the lesson, the students first work in pairs or threes on the same task. Then working in the same small groups, they analyze work produced by other students on the task. </li><li>In a whole-class discussion, students compare and evaluate the methods they have seen and used. </li><li>In the final part of the lesson, students review their initial, individual solutions and use their learning to complete a new task. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1307"
    ]
  },
  "?taskid=452": {
    "lessons": [
      "download.php?fileid=1302"
    ],
    "title": "Analyzing Congruence Proofs",
    "objectives": [
      "To help you assess how well students are able to work with concepts of congruency and similarity, including identifying corresponding sides and corresponding angles within and between triangles.",
      "To help you assess how well students are able to identify and understand the significance of a counter-example.",
      "To help you assess how well students are able to prove, and evaluate proofs in a geometric context."
    ],
    "standards": {
      "content": {
        "H.G-SRT": "Understand similarity in terms of similarity transformations",
        "H.G-CO": "Understand congruence in terms of rigid motions"
      },
      "practices": [
        "MP3",
        "MP5",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Glue sticks",
      "Blank paper, scrap paper, rules, compasses, and rulers, and protractors",
      "Projector (optional)"
    ],
    "image_url": "",
    "context": [
      "<ul><li>In this lesson, students work on the concept of congruency whilst developing their understanding of proof in a geometric context. </li><li>Before the lesson, students complete a task designed to help you understand their current levels of understanding. You analyze their responses and write questions to help them improve their work.</li><li>The lesson begins with a whole-class discussion about establishing conditions for congruency from triangle properties. Students work alone to decide on the truth of a conjecture about congruency conditions for triangles. They then work in pairs to share their ideas, and produce and justify a joint response. Working in the same pairs, they analyze sample responses produced by other students. In a whole-class discussion, students develop their understanding of proof in this context.</li><li>In a follow-up lesson students then use what they have learned from the lesson to improve their responses to a task similar to the initial assessment task.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1303"
    ]
  },
  "?taskid=453": {
    "lessons": [
      "download.php?fileid=1304"
    ],
    "title": "Using Positive and Negative Numbers in Context",
    "objectives": [
      "To help you assess how well students are able to understand and use directed numbers in context. It is intended to help identify and aid students who have difficulties in ordering, comparing, adding, and subtracting positive and negative integers. Particular attention is paid to the use of negative numbers on number lines to explore the structures: starting temperature + change in temperature = final temperature final temperature - change in temperature = starting temperature final temperature - starting temperature = change in temperature"
    ],
    "standards": {
      "content": {
        "7.NS": "Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
        "7.EE": "Use properties of operations to generate equivalent expressions."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of lesson resources",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/453.png",
    "context": [
      "<ul><li>Before the lesson students should work individually on an assessment task designed to help you understand their current levels of understanding and difficulties. You review their responses and write questions to help them improve their work.</li><li>After a whole-class introduction, students work together in small groups on a card-matching task. In the same small groups, they then create directed number calculations to correspond to temperature changes or city temperatures. To end the lesson there is a whole-class discussion. </li><li>In a follow-up session, students again work alone on task similar to the assessment task. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1305"
    ]
  },
  "?taskid=599": {
    "lessons": [
      "download.php?fileid=1570"
    ],
    "title": "Understanding Relative Frequency",
    "objectives": [
      "To help students to understand the connection between relative frequency and probability.",
      "To help students to gain experience of designing and carrying out a probability experiment.",
      "To help students to calculate a theoretical probability for a practical scenario."
    ],
    "standards": {
      "content": {
        "<a class=\"standardcode\" href=\"stds.php?id=1603\" title=\"Statistics and Probability\">7.SP</a>": "Statistics and Probability"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Copies of the questionnaire",
      "Copies of the game board",
      "Plain paper",
      "A quarter and 50-cents coin",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/599.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Throwing a Coin</em> task individually. You then review their responses and create questions for students to consider to help them to improve their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in pairs or threes, combining their thinking and working together to devise a plan for working out which game design will make the most money for charity before implementing their agreed strategy.</li><li>In the same small groups, students evaluate and comment on sample responses, identifying the strengths and weaknesses and comparing each approach with their own ideas. Following their evaluation of the sample responses, students review their work to ensure they are happy with and can justify their solution.</li><li>In a final whole-class discussion, students share their work and consider the advantages and disadvantages of the approaches taken.</li><li>In a follow-up lesson, students reflect on how they have worked.</li></ul>"
    ],
    "time": [
      110
    ],
    "resources": [
      "download.php?fileid=1571"
    ]
  },
  "?taskid=598": {
    "lessons": [
      "download.php?fileid=1567"
    ],
    "title": "Investigating: Consecutive Sums",
    "objectives": [
      "To help students to state and test mathematical conjectures.",
      "To help students to understand and use alternative methods of proof."
    ],
    "standards": {
      "content": {
        "6.EE": "Apply and extend previous understandings of arithmetic to algebraic expressions."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the task",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Calculators",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/598.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Consecutive Sums</em> task individually. You review their responses and formulate questions for students to consider in order to improve their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students consider a conjecture about the sums of <em>four </em>consecutive whole numbers before looking in pairs at some sample work in which other students attempt to justify the conjecture. They seek to improve the arguments given and compare the different approaches used.</li><li>In the same small groups, students then work together to classify other conjectures about consecutive sums according to whether they are always, sometimes or never true. Groups produce a poster to show their conclusions and their reasoning.</li><li>In a whole-class discussion, students discuss their categorization of the conjectures.</li><li>Finally, students reflect individually on the different approaches seen and used.</li></ul>"
    ],
    "time": [
      120
    ],
    "resources": [
      "download.php?fileid=1568"
    ]
  },
  "?taskid=595": {
    "lessons": [
      "download.php?fileid=1560"
    ],
    "title": "Representing Data Using Grouped Frequency Graphs and Box Plots",
    "objectives": [
      "To help you assess how well students are able to interpret frequency graphs that use grouped data and their associated box plots. In particular this unit aims to identify and help students who have difficulty interpreting information from frequency graphs and box plots; such as minimum and maximum values, medians and quartiles."
    ],
    "standards": {
      "content": {
        "<a class=\"standardcode\" href=\"stds.php?id=1756\" title=\"Statistics and Probability\">6.SP</a>": "Statistics and Probability"
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP6",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/595.png",
    "context": [
      "<ul><li>Before the lesson, students individually complete an assessment task that is designed to reveal their current understanding and difficulties.</li><li>A whole-class introduction gives guidance to students on how to work during the collaborative activity.</li><li>Students then work in pairs or threes on a collaborative discussion task, matching grouped frequency graphs to box plots.</li><li>Towards the end of the lesson there is a whole-class discussion.</li><li>In a follow-up lesson, students work alone on a similar task to the introductory assessment task.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1562"
    ]
  },
  "?taskid=594": {
    "lessons": [
      "download.php?fileid=1558"
    ],
    "title": "Modeling: A Race",
    "objectives": [
      "To help you assess how well students are able to model a real-world situation and compare and critique sample models. In particular this lesson aims to identify and help students who have difficulty recognizing and using proportional relationships."
    ],
    "standards": {
      "content": {
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Copies of the questionnaire",
      "Large sheets of poster paper",
      "Glue sticks",
      "Post-it notes",
      "Calculators and graph paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/594.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>A Race</em> task individually. You then assess their responses and formulate questions that will prompt students to review their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in pairs or threes to combine their thinking and work together to produce a collaborative solution to the <em>A Race</em> task, in the form of a poster.</li><li>Working in the same small groups, students evaluate, comment on and complete sample responses.</li><li>In a whole-class discussion students compare and evaluate the methods they have seen and used.</li><li>Finally, in a follow-up lesson, students reflect on their work and what they have learned.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1559"
    ]
  },
  "?taskid=597": {
    "lessons": [
      "download.php?fileid=1565"
    ],
    "title": "The Area of a Circle",
    "objectives": [
      "To help students to apply their knowledge of the relationship between the radius and the area of a circle. ",
      "Students will be able to sketch and construct loci involving arcs of circles.",
      "Students will be able to calculate the area of a circle, given its radius.",
      "Students will be able to calculate the radius of a circle, given its area."
    ],
    "standards": {
      "content": {
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Plain paper",
      "Glue sticks",
      "Calculators",
      "Compasses",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/597.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understanding and difficulties. You then review their solutions and create questions for students to help them to improve their work. They receive this feedback in the follow up lesson.</li><li>After a whole-class introduction students work in small groups on a collaborative task, finding the rope length necessary to enable a goat to eat a specified area of grass.</li><li>In the same small groups, students then evaluate and comment on sample responses, identifying the strengths and weaknesses in each approach and comparing them with their own work. After another whole-class discussion, they then try to improve their collaborative work.</li><li>In an optional final whole-class discussion, students discuss the methods they have seen and used.</li><li>Finally, students work individually either on a new assessment task, or return to the original task and try to improve their responses.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1566"
    ]
  },
  "?taskid=596": {
    "lessons": [
      "download.php?fileid=1563"
    ],
    "title": "Probability Games",
    "objectives": [
      "To help students to confront and overcome common probability misconceptions.",
      "To help students to count equally likely outcomes using diagrams.",
      "To help students to discuss relationships between theoretical probabilities, observed outcomes and sample sizes.",
      "To help students to calculate probabilities of independent events."
    ],
    "standards": {
      "content": {
        "7.SP": "Investigate chance processes and develop, use, and evaluate probability models."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of sample reasoning sheets",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/596.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task designed to reveal their current level of understanding. You review their scripts and write questions to help your students improve their work.</li><li>In the lesson, students are asked to work collaboratively on some simple games. They make predictions of the outcomes and then conduct the experiments and gather data.</li><li>In a follow-up lesson, students use their learning and your questions to review their initial answers and to complete a follow-up task.</li></ul>"
    ],
    "time": [
      120
    ],
    "resources": [
      "download.php?fileid=1564",
      "http://map.mathshell.org/lesson_support/probability_games/index.html",
      "http://map.mathshell.org/lesson_support/probability_games/index.html"
    ]
  },
  "?taskid=591": {
    "lessons": [
      "download.php?fileid=1554"
    ],
    "title": "Optimizing: Packing It In",
    "objectives": [
      "To help students to reason precisely and defend their conclusions.",
      "To help students to use mathematics to model a scenario concerning volume."
    ],
    "standards": {
      "content": {
        "6.G": "Solve real-world and mathematical problems involving area, surface area, and volume."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP5"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Blank paper",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Graph paper",
      "Small cardboard boxes",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/591.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the task <em>Packing It In</em> individually. You review their responses and formulate questions that will help them improve their work.</li><li>At the start of the lesson, students read your comments and consider ways to improve their work.</li><li>In pairs or threes, students work together to develop a better solution, producing a poster to show their conclusions and their reasoning.</li><li>Then, in the same small groups, students look at some sample student work showing different approaches to the problem. They evaluate the strategies used and seek to improve the arguments given.</li><li>In a whole-class discussion, students compare different solution methods.</li><li>Finally, students reflect individually on their learning.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1555"
    ]
  },
  "?taskid=590": {
    "lessons": [
      "download.php?fileid=1552"
    ],
    "title": "Modeling: Buying Cars",
    "objectives": [
      "To help you assess how well students are able to solve a real-world problem that involves rates of change. In particular it will help you assess how well students are able to create, compare and evaluate different representations of functions."
    ],
    "standards": {
      "content": {
        "8.F": "Define, evaluate, and compare functions."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the task",
      "Blank sheets of paper",
      "Copies of the questionnaire",
      "Large sheets of poster paper and felt-tipped pens",
      "Graph paper and rulers",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/590.png",
    "context": [
      "<ul><li>Before the lesson, students tackle the problem individually. You review their work and write questions to help students improve their solutions.</li><li>At the beginning of the lesson, students respond to your questions. Students are then grouped into pairs and work collaboratively to produce better solutions to the same task.</li><li>There is a whole-class discussion to compare and evaluate different approaches.</li><li>This is followed by a second collaborative activity when student work in small groups to evaluate and comment on sample solutions, followed by a second a whole-class discussion about the work.</li><li>Finally, students review and evaluate their work on the problem.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1553"
    ]
  },
  "?taskid=593": {
    "lessons": [
      "download.php?fileid=1556"
    ],
    "title": "Adding and Subtracting Directed Numbers",
    "objectives": [
      "To help students to add and subtract directed numbers (positive, negative and zero) with understanding.",
      "To help students to address common misconceptions about the addition and subtraction of directed numbers.",
      "To help students to explain their reasoning using diagrams."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of numbers to the system of rational numbers."
      },
      "practices": [
        "MP2",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Cut-up copies of the card sets",
      "Glue sticks"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/593.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class discussion that introduces the charge model for directed numbers, students work in small groups on two collaborative discussion tasks in which they match diagrams with calculations and produce missing diagrams for the remaining calculations.</li><li>In a whole-class discussion, students discuss what they have learned.</li><li>Finally, students revisit their initial work on the assessment task and work alone on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1557"
    ]
  },
  "?taskid=218": {
    "lessons": [
      "download.php?fileid=688"
    ],
    "title": "Sorting Equations and Identities",
    "objectives": [
      "To help you assess how well students are able to recognize the differences between equations and identities.",
      "To help you assess how well students are able to substitute numbers into algebraic statements in order to test their validity in special cases.",
      "To help you assess how well students are able to resist common errors when manipulating expressions such as 2(x - 3) = 2x - 3; (x + 3)<sup>2</sup> = x<sup>2</sup> + 3<sup>2</sup>.",
      "To help you assess how well students are able to carry out correct algebraic manipulations.",
      "It also aims to encourage discussion on some common misconceptions about algebra."
    ],
    "standards": {
      "content": {
        "H.A-SSE": "Interpret the structure of expressions",
        "H.A-REI": "Solve equations and inequalities in one variable"
      },
      "practices": [
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and marker pens",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/218.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work, and create questions for students to answer in order to improve their solutions.</li><li>After a whole-class introduction, students work in small groups on a collaborative discussion task. </li><li>Students return to their original task and try to improve their own responses.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=689"
    ]
  },
  "?taskid=219": {
    "lessons": [
      "download.php?fileid=690"
    ],
    "title": "Defining Regions Using Inequalities",
    "objectives": [
      "To help you assess how well students are able to use linear inequalities to create a set of solutions.",
      "To help you identify and assist students who have difficulties in representing a constraint by shading the correct side of the inequality line.",
      "To help you identify and assist students who have difficulties in understanding how combining inequalities affects a solution space."
    ],
    "standards": {
      "content": {
        "H.A-REI": "Represent and solve equations and inequalities graphically."
      },
      "practices": [
        "MP1"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Mini-whiteboard or squared paper, pen and an eraser",
      "Copies of the game sheet",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/219.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current levels of understanding and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>After a whole-class introduction students work collaboratively, in pairs, on a game. One student decides on the position of a 'target point' on a coordinate grid and gives clues in the form of algebraic inequalities (e.g. 3y + 2x < 12). The other student uses these clues to find the location of the target point. There is a strategic element to the game: what are the best clues to give, so that the target may be found quickly?</li><li>In a whole-class discussion students review the main math concepts of the lesson.</li><li>Students return to their original assessment tasks, and try to improve their own responses.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=691"
    ]
  },
  "?taskid=212": {
    "lessons": [
      "download.php?fileid=675"
    ],
    "title": "Evaluating Statements About Length and Area",
    "objectives": [
      "To help you assess how well students can understand the concepts of length and area.",
      "To help you assess how well students can use the concept of area in proving why two areas are or are not equal.",
      "To help you assess how well students can construct their own examples and counterexamples to help justify or refute conjectures."
    ],
    "standards": {
      "content": {
        "H.G-CO": "Prove geometric theorems"
      },
      "practices": [
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Sheets of plain paper",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/212.png",
    "context": [
      "<ul><li>Students will need to be familiar with the concepts of area and perimeter. This activity will help consolidate understanding, and overcome some common misconceptions such as the notion that perimeter and area are in some way related.</li><li>Before the lesson, students work individually on an assessment task designed to reveal their current understandings and difficulties. You then review their work, and create questions for the students to answer in order to improve their solutions.</li><li>The whole-class introduction models the level of reasoning that is required in the main part of the lesson. During this introduction, students critique examples of other students' work.</li><li>Students are grouped into pairs and given some mathematical statements. Each pair chooses one of the statements and, using their own examples, counterexamples, and arguments decides if the statement is true or false. They create posters showing their collaborative reasoning.</li><li>In a whole-class discussion, students explain and compare the various solution strategies they have used. </li><li>Students return to their original assessment tasks, and try to improve their own responses.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=676"
    ]
  },
  "?taskid=213": {
    "lessons": [
      "download.php?fileid=1522"
    ],
    "title": "Evaluating Statements About Enlargements (2D and 3D)",
    "objectives": [
      "To help you assess how well students are able to solve problems involving area and volume.",
      "To help you identify and assist students who have difficulties with computing perimeters, areas and volumes using formulas.",
      "To help you identify and assist students who have difficulties with finding the relationships between perimeters, areas, and volumes of shapes after scaling."
    ],
    "standards": {
      "content": {
        "H.G-GMD": "Explain volume formulas and use them to solve problems"
      },
      "practices": [
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper",
      "Glue sticks",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/213.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>After a whole-class introduction, students work in small groups. They consider the results of doubling the measurements of a range of shapes in two and three dimensions.</li><li>After a whole-class discussion, students return to their original task and try to improve their own responses.</li></ul>"
    ],
    "time": [
      70
    ],
    "resources": [
      "download.php?fileid=679"
    ]
  },
  "?taskid=210": {
    "lessons": [
      "download.php?fileid=1572"
    ],
    "title": "Increasing and Decreasing Quantities by a Percent",
    "objectives": [
      "To help you assess how well students are able to interpret percent increase and decrease.",
      "To identify and help students who have difficulties with translating between percents, decimals, and fractions.",
      "To identify and help students who have difficulties with representing percent increase and decrease as multiplication.",
      "To identify and help students who have difficulties with recognizing the relationship between increases and decreases."
    ],
    "standards": {
      "content": {
        "7.NS": "Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
        "7.RP": "Analyze proportional relationships and use them to solve real-world and mathematical problems."
      },
      "practices": [
        "MP2",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster card",
      "Glue sticks",
      "Calculators",
      "Copies of lesson resources",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/210.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task that is designed to reveal their current understandings and difficulties. You then review their work, and create questions for students to answer in order to improve their solutions.</li><li>Students work in small groups on collaborative discussion tasks, to organize percent, decimal and fraction cards. As they do this, they interpret the cards' meanings and begin to link them together. They also try to find relationships between percent changes. Throughout their work, students justify and explain their decisions to their peers.</li><li>Students return to their original assessment tasks, and try to improve their own responses.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1523"
    ]
  },
  "?taskid=211": {
    "lessons": [
      "download.php?fileid=673"
    ],
    "title": "Modeling Situations With Linear Equations",
    "objectives": [
      "To help you assess how well students use algebra in context, and in particular, how well students explore relationships between variables in everyday situations.",
      "To help you assess how well students use algebra in context, and in particular, how well students find unknown values from known values.",
      "To help you assess how well students use algebra in context, and in particular, how well students find relationships between pairs of unknowns, and express these as tables and graphs.",
      "To help you assess how well students use algebra in context, and in particular, how well students find general relationships between several variables, and express these in different ways by rearranging formulae."
    ],
    "standards": {
      "content": {
        "8.F": "Use functions to model relationships between quantities."
      },
      "practices": [
        "MP2",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of lesson task sheet",
      "Mini-whiteboard, pen and an eraser",
      "Graph paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/211.png",
    "context": [
      "<ul><li>This activity links several aspects of algebra. A situation is presented, and relationships between the variables are explored in depth. Letters are used to represent unknowns, generalized numbers, and variables. The problem-solving context gives you a chance to assess how well students are able to combine and apply different aspects of their algebra knowledge and skills.</li><li>Before the lesson, students work individually on the assessment task <em>The Guitar Cla</em>s<em>s</em>. You then review their work and create questions for students to answer at the end of the lesson, to help them to improve their solutions. </li><li>During the lesson, students translate between words, algebraic formulae, tables, and graphs in an interactive whole-class discussion. The intention is that you focus students on making sense of the context using algebra, rather than just the routine use of techniques and skills. Students then work in pairs to graph the relationship between two of the variables. In a final whole-class discussion, students identify general formulae showing the relationships between all the variables. </li><li>At the end of the lesson, students review and improve their individual work. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=674"
    ]
  },
  "?taskid=216": {
    "lessons": [
      "download.php?fileid=684"
    ],
    "title": "Calculating Volumes of Compound Objects",
    "objectives": [
      "To help you assess how well students solve problems involving measurement.",
      "To identify and help students who have difficulties with computing measurements using formulas.",
      "To identify and help students who have difficulties with decomposing compound shapes into simpler ones.",
      "To identify and help students who have difficulties with using right triangles and their properties to solve real-world problems."
    ],
    "standards": {
      "content": {
        "H.G-GMD": "Explain volume formulas and use them to solve problems",
        "H.G-SRT": "Define trigonometric ratios and solve problems involving right triangles"
      },
      "practices": [
        "MP1",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of the lesson resources",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/216.png",
    "context": [
      "<ul> <li>Before the lesson, students attempt the task individually. You then review their work and formulate questions for students to answer, in order for them to improve their work.</li> <li>At the start of the lesson, students work individually to answer your questions. They thenwork in small groups on the same task, to produce a better collective solution than those they produced individually. Throughout their work they justify and explain their decisions to each other.</li> <li>In the same small groups, students critique some student responses to the <em>Glasses</em> task, provided in the resource <em>Sample Responses to Discuss.</em> They correct errors in those responses.</li> <li>In a whole-class discussion, students discuss their own solutions, and explain how to correct the common misconceptions seen in the <em>Sample Responses to Discuss</em>. </li> <li>Finally, students work on their own again to improve their individual solutions. </li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=685"
    ]
  },
  "?taskid=217": {
    "lessons": [
      "download.php?fileid=686"
    ],
    "title": "Interpreting Statistics: A Case of Muddying the Waters",
    "objectives": [
      "To help you assess how well students are able to interpret data and evaluate statistical summaries.",
      "To help you assess how well students are able to critique someone else's interpretations of data and evaluations of statistical summaries.",
      "To introduce to students the dangers of misapplying simple statistics in real-world contexts, and illustrates some of the common abuses of statistics and charts found in the media."
    ],
    "standards": {
      "content": {
        "H.S-ID": "Interpret linear models",
        "H.S-IC": "Make inferences and justify conclusions from sample surveys, experiments, and observational studies"
      },
      "practices": [
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Copies of role-play script",
      "Copies of lesson worksheet",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/217.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on a task that is designed to reveal their current understandings and difficulties. You review their work and create some questions that will help them to improve their solutions. </li><li>At the start of the lesson, students role-play a scene that provides the background to the lesson task. Next, students work in small groups on a collaborative discussion task. They extract information from evidence and critically assess how it was gathered and presented.</li><li>After a whole-class discussion students again work individually, on a new task. This has similar content to the original task, allowing them to demonstrate the progress they have made during the lesson.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=687"
    ]
  },
  "?taskid=214": {
    "lessons": [
      "download.php?fileid=680"
    ],
    "title": "Applying Angle Theorems",
    "objectives": [
      "To help you assess how well students are able to use geometric properties to solve problems.",
      "To support you in identifying and helping students who have difficulties with solving problems relating to using the measures of the interior angles of polygons.",
      "To support you in identifying and helping students who have difficulties with solving problems relating to using the measures of the exterior angles of polygons."
    ],
    "standards": {
      "content": {
        "7.G": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume."
      },
      "practices": [
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of the lesson task",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/214.png",
    "context": [
      "<ul> <li>Before the lesson, students work individually to complete an assessment task that is designed to reveal their current understandings and difficulties.</li> <li>During the lesson, students work in pairs and threes on a collaborative discussion task. They are shown four methods for solving an angle problem, and work together to complete the problem using each of the methods in turn. As they do this, they justify their work to each other. </li> <li>Working in the same small groups, students analyze sample solutions to the same angle problem produced by students from another class. They identify errors and follow reasoning in the sample solutions. </li> <li>There is then a whole-class discussion in which students explain the reasoning in the sample solutions and compare the methods. </li> <li>Finally, students return to their original task, and try to improve their own responses. </li> </ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=681"
    ]
  },
  "?taskid=215": {
    "lessons": [
      "download.php?fileid=682"
    ],
    "title": "Generalizing Patterns: Table Tiles",
    "objectives": [
      "To help you assess how well students are able to identify linear and quadratic relationships in a realistic context: the number of tiles of different types that are needed for a range of square tabletops.",
      "To identify and help students who have difficulties with choosing an appropriate, systematic way to collect and organize data.",
      "To identify and help students who have difficulties with examining the data and looking for patterns; finding invariance and covariance in the numbers of different types of tile.",
      "To identify and help students who have difficulties with generalizing using numerical, geometrical or algebraic structure.",
      "To identify and help students who have difficulties with describing and explaining findings clearly and effectively."
    ],
    "standards": {
      "content": {
        "H.F-BF": "Build a function that models a relationship between two quantities"
      },
      "practices": [
        "MP7",
        "MP8"
      ]
    },
    "materials": [
      "Copies of the lesson worksheets",
      "Grid paper",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/215.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the task individually. You then review their work and formulate questions for students to answer in order for them to improve their work.</li><li>At the start of the lesson, students work individually to answer your questions. </li><li>Next, they work collaboratively, in small groups, to produce a better collective solution than those they produced individually. Throughout their work, they justify and explain their decisions to peers. </li><li>In the same small groups, students critique examples of other students' work. </li><li>In a whole-class discussion, students explain and compare the alternative approaches they have seen and used. </li><li>Finally, students work alone again to improve their individual solutions. </li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=683"
    ]
  },
  "?taskid=582": {
    "lessons": [
      "download.php?fileid=1533"
    ],
    "title": "A Measure of Slope",
    "objectives": [
      "To assess students' understanding of the four quadrants of the coordinate plane, while at the same time introducing them to a mathematical understanding of slope. The task helps students to link their intuitive understandings of steepness to a more precise, calculated measure of slope."
    ],
    "standards": {
      "content": {
        "6.NS": "Apply and extend previous understandings of numbers to the system of rational numbers."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3"
      ]
    },
    "materials": [
      "Copies of the task sheets",
      "Squared paper or graph paper",
      "Cut-up copies of the card sets",
      "Protractors",
      "Tracing paper",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/582.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task, <em>Steepness</em>, which is designed to reveal their current understandings with regard to slope. You then review their work and create questions for students to answer in order to improve their solutions.</li><li>In the lesson, students work in small groups on a collaborative task in which they put line segments into order of slope. They then examine some sample student work and critique the measures of slope used there.</li><li>Then students try to construct a better measure of slope.</li><li>In a follow-up lesson, students receive your comments on the assessment task and use these to attempt the similar task, <em>More Steepness</em>, approaching it with insights that they have gained from the lesson.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1534"
    ]
  },
  "?taskid=583": {
    "lessons": [
      "download.php?fileid=1535"
    ],
    "title": "Lines, Slopes and Linear Equations",
    "objectives": [
      "To help you assess how well students are able to find the slopes and equations of linear graphs defined by pairs of coordinates.",
      "To help you assess how well students are able to calculate the slope and <em>y</em>-intercept of a straight line.",
      "To help you assess how well students are able to use the slope and <em>y</em>-intercept of a straight line to derive its equation."
    ],
    "standards": {
      "content": {
        "8.EE": "Understand the connections between proportional relationships, lines, and linear equations."
      },
      "practices": [
        "MP1",
        "MP6",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and felt-tipped pens",
      "Glue sticks",
      "Pencil",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/583.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work in small groups on a collaborative discussion task, matching cards that describe the same line. Throughout their work, students justify and explain their thinking and reasoning.</li><li>Students review their work by comparing their matches with those of their peers.</li><li>In a whole-class discussion, students discuss what they have learned.</li><li>In a follow-up lesson, students revisit their initial work on the assessment task and work alone on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      80
    ],
    "resources": [
      "download.php?fileid=1536"
    ]
  },
  "?taskid=580": {
    "lessons": [
      "download.php?fileid=1529"
    ],
    "title": "Interpreting Equations",
    "objectives": [
      "To help students to connect algebraic equations to real-life situations.",
      "To help students to uncover and address misconceptions concerning the meaning of variables in equations."
    ],
    "standards": {
      "content": {
        "6.EE": "Reason about and solve one-variable equations and inequalities."
      },
      "practices": [
        "MP2",
        "MP4",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Blank paper",
      "Cut-up copies of the lesson sheets",
      "Large sheets of poster paper",
      "Glue sticks",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/580.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding. You then review their responses and create questions for students to consider when improving their work.</li><li>In a whole-class discussion, students consider how the meaning of different equations and expressions changes when the definitions of the variables change.</li><li>Students then work in small groups (pairs or threes) on a collaborative discussion task, finding word explanations to go alongside the appropriate expressions and equations. Students are encouraged to challenge one another.</li><li>In a whole-class discussion, students discuss what they have learned.</li><li>Finally, students revisit their initial work on the assessment task and work alone on a task similar to the introductory task.</li></ul>"
    ],
    "time": [
      60
    ],
    "resources": [
      "download.php?fileid=1530"
    ]
  },
  "?taskid=581": {
    "lessons": [
      "download.php?fileid=1531"
    ],
    "title": "Possible Triangle Constructions",
    "objectives": [
      "To help you assess how students reason about geometry.",
      "To help you assess how well students are able to recall and apply triangle properties.",
      "To help you assess how well students are able to sketch and construct triangles with given conditions.",
      "To help you assess how well students are able to determine whether a set of given conditions for the measures of angle and/or sides of a triangle describe a unique triangle, more than one possible triangle or does not describe a possible triangle."
    ],
    "standards": {
      "content": {
        "7.G": "Draw, construct, and describe geometrical figures and describe the relationships between them."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP5"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Large sheets of poster paper and markers",
      "Glue sticks",
      "Pencils",
      "Rulers, Protractors and compasses"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/581.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and ability to reason using geometrical properties. You then review their responses and create questions for students to consider when improving their work.</li><li>After a whole-class introduction, students work in pairs or threes on a collaborative discussion task, determining whether sets of conditions describe possible triangles (unique or otherwise) or whether it is impossible to draw a triangle with the conditions given. Throughout their work, students justify and explain their thinking and reasoning.</li><li>Students review their work by comparing their categorizations with their peers.</li><li>In a whole-class discussion, students review their work and discuss what they have learned.</li><li>In a follow-up lesson, students review their initial work on the assessment task and work alone on a similar task to the introductory task.</li></ul>"
    ],
    "time": [
      75
    ],
    "resources": [
      "download.php?fileid=1532"
    ]
  },
  "?taskid=586": {
    "lessons": [
      "download.php?fileid=1544"
    ],
    "title": "Testing a New Product",
    "objectives": [
      "To help you assess how well students are able to organize, represent and analyze bivariate categorical data in an appropriate way.",
      "To identify and help students who have difficulty in choosing a suitable, systematic way to collect and organize the data. This could include constructing tables, two-way tables, or frequency charts.",
      "To identify and help students who have difficulty in interpreting their own and others' findings clearly and effectively."
    ],
    "standards": {
      "content": {
        "8.SP": "Investigate patterns of association in bivariate data."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP7"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of the review questionnaire",
      "Sheets of paper",
      "Cut-up copies of the lesson sheets",
      "Large sheets of poster paper and felt-tipped pens",
      "Graph paper and rulers",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/586.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task designed to reveal their current understanding and difficulties. You review their responses and create questions for them to consider when improving their work.</li><li>At the start of the lesson, students reflect on their individual responses and use the questions posed to think of ways to improve their work. They then work collaboratively in small groups to produce, in the form of a poster, a better strategy to the task than they did individually. In the same small groups they implement the strategy.</li><li>In a whole-class discussion students compare and evaluate the different strategies they have used.</li><li>Working in the same small groups, students analyze sample responses to the task.</li><li>In a whole-class discussion, students review the methods they have seen.</li><li>At the end of the lesson or in a follow-up lesson, students reflect individually on their work.</li></ul>"
    ],
    "time": [
      100
    ],
    "resources": [
      "download.php?fileid=1545"
    ]
  },
  "?taskid=587": {
    "lessons": [
      "download.php?fileid=1582"
    ],
    "title": "Using Standard Algorithms",
    "objectives": [
      "To help students to make sense of standard algorithms for addition, subtraction, multiplication and division of positive integers.",
      "To assist students in improving conceptual understanding of why and how the algorithms work.",
      "To assist students in developing procedural fluency in carrying out the algorithms.",
      "To assist students in becoming more able to spot unreasonably sized answers and to debug errors in procedures."
    ],
    "standards": {
      "content": {
        "6.NS": "Compute fluently with multi-digit numbers and find common factors and multiples."
      },
      "practices": [
        "MP2",
        "MP3",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Cut-up copies of the card sets",
      "Blank paper"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/587.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task, <em>Getting it Wrong</em>, designed to reveal their current understanding and difficulties. You review their solutions and create questions for students to answer in order to improve their work.</li><li>The main lesson begins with a whole-class introduction, in which students critique systematic errors in standard algorithms. Students try to explain <strong>why </strong>what is being done does not work.</li><li>Then students work in pairs or threes on a collaborative task to find errors in some sample student work. They are encouraged to go beyond 'correcting' the answers to conjecturing why the student might have made the error and explaining why the method used does not (always) work.</li><li>In a whole-class discussion, students describe what they have learned from the task.</li><li>Finally, students receive your comments on the assessment task and use these to attempt a similar task, <em>Getting it Wrong (Revisited)</em>, approaching it with insights that they have gained from the lesson.</li></ul>"
    ],
    "time": [
      90
    ],
    "resources": [
      "download.php?fileid=1547"
    ]
  },
  "?taskid=584": {
    "lessons": [
      "download.php?fileid=1540"
    ],
    "title": "Finding Shortest Routes: The Schoolyard Problem",
    "objectives": [
      "To help students to select appropriate mathematics to solve a problem.",
      "To help students to compare and evaluate different methods for solving a problem and make generalizations about the appropriateness of different approaches.",
      "To help students to understand the Pythagorean Theorem and how it can be used to solve problems in the real world."
    ],
    "standards": {
      "content": {
        "8.G": "Understand and apply the Pythagorean Theorem."
      },
      "practices": [
        "MP1",
        "MP3",
        "MP4",
        "MP6"
      ]
    },
    "materials": [
      "Copies of the task",
      "Large sheets of poster paper and markers",
      "Graph paper and rulers",
      "Calculators",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/584.png",
    "context": [
      "<ul><li>Before the lesson, students attempt <em>The Schoolyard Problem</em> individually. You review these initial attempts, formulating questions that will help students to improve their work. </li><li>After a brief lesson introduction, students respond individually to the questions on their work.</li><li>Then, in groups of 2 or 3, students compare their different approaches and examine and comment on some sample student responses. They identify features of these responses that may help them with their own work. </li><li>In the same small groups, students now work together to produce a collaborative solution in the form of a poster.</li><li>In a whole-class discussion, students explain and compare the strategies they have seen and used.</li><li>Finally, students reflect on their work and their learning.</li></ul>"
    ],
    "time": [
      95
    ],
    "resources": [
      "download.php?fileid=1541"
    ]
  },
  "?taskid=585": {
    "lessons": [
      "download.php?fileid=1542"
    ],
    "title": "Solving Real-life Problems: Selling Soup",
    "objectives": [
      "To help you assess how well students are able to solve real-life mathematical problems.",
      "Students will develop their abilities in using proportional relationships to solve multistep ratio and percent problems.",
      "Students will develop their abilities in drawing inferences about a population from a random sample of data.",
      "Students will develop their abilities in making and stating assumptions based on real-life situations."
    ],
    "standards": {
      "content": {
        "6.RP": "Understand ratio concepts and use ratio reasoning to solve problems."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the task sheets",
      "Mini-whiteboard, pen and an eraser",
      "Plain paper",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/585.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Selling Soup </em>task individually. You review their solutions and formulate questions that will help students to improve their work. </li><li>At the start of the lesson, students respond individually to the questions set. </li><li>In groups, students combine their thinking and work together to produce a collaborative solution in the form of a poster.</li><li>In the same small groups, students evaluate and comment on some sample responses. They evaluate these responses and compare them with their own work.</li><li>In a whole-class discussion, students explain and compare solution strategies.</li><li>Finally, students reflect on their work and their learning.</li></ul>"
    ],
    "time": [
      120
    ],
    "resources": [
      "download.php?fileid=1543"
    ]
  },
  "?taskid=588": {
    "lessons": [
      "download.php?fileid=1548"
    ],
    "title": "Modeling: Car Skid Marks",
    "objectives": [
      "To help you assess how well students are able to use an approximate mathematical model of a real-world situation and use data to test, critique and compare models. In particular this unit aims to identify and help students who have difficulty using variables to represent quantities and analyze the relationship between these variables using tables, graphs, and equations."
    ],
    "standards": {
      "content": {
        "6.EE": "Represent and analyze quantitative relationships between dependent and independent variables."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP4"
      ]
    },
    "materials": [
      "Copies of the assessment task",
      "Copies of the review questionnaire",
      "Mini-whiteboard, pen and an eraser",
      "Calculators",
      "Graph paper",
      "Large sheets of paper",
      "Copies of sample responses",
      "Projector (optional)"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/588.png",
    "context": [
      "<ul><li>Before the lesson, students attempt the <em>Car Skid Marks</em> task individually. You then assess their responses and formulate questions that will prompt them to review their work.</li><li>At the start of the lesson, students think individually about their responses to the questions set.</li><li>Next, students work in small groups to combine their thinking and work together to produce a collaborative solution to the <em>Car Skid Marks</em> task, in the form of a poster.</li><li>Working in the same small groups, students evaluate and comment on sample responses, identifying the strengths and weaknesses in each approach and comparing them with their own work. In a whole-class discussion, students compare and evaluate the methods they have seen and used.</li><li>In a follow-up lesson, students reflect on their work and what they have learned.</li></ul>"
    ],
    "time": [
      95
    ],
    "resources": [
      "download.php?fileid=1549"
    ]
  },
  "?taskid=589": {
    "lessons": [
      "download.php?fileid=1550"
    ],
    "title": "Comparing Data",
    "objectives": [
      "To help students to make meaningful comparisons between sets of data.",
      "Students will develop their abilities in selecting appropriate measures of center and variability in order to summarize the important features of a set of data.",
      "Students will develop their abilities in using quantitative measures to justify an argument."
    ],
    "standards": {
      "content": {
        "7.SP": "Draw informal comparative inferences about two populations."
      },
      "practices": [
        "MP1",
        "MP2",
        "MP3",
        "MP5"
      ]
    },
    "materials": [
      "Copies of the assessment tasks",
      "Mini-whiteboard, pen and an eraser",
      "Copies of lesson resources",
      "Blank paper",
      "Calculators",
      "Scissors"
    ],
    "image_url": "http://map.mathshell.org/materials/_map/_map/task_img/589.png",
    "context": [
      "<ul><li>Before the lesson, students work individually on an assessment task, <em>Getting James to Work</em>, designed to reveal their current understandings and difficulties. You review their solutions and create questions for them to answer in order to improve their work.</li><li>The lesson begins with a whole-class introduction in which students review important terms.</li><li>Students work in pairs on a collaborative task in which they create data to satisfy written descriptions. When they have constructed their data sets, they separate their data from the descriptive text and pass the data to students in another group, who have not worked with the data to construct a description of their own. The two descriptions are then compared.</li><li>In a whole-class discussion students discuss their approaches to the task and what they have learned.</li><li>In a follow-up lesson, students receive your comments on the assessment task and use these to attempt another task, approaching it with insights that they have gained from the lesson.</li></ul>"
    ],
    "time": [
      110
    ],
    "resources": [
      "download.php?fileid=1551"
    ]
  }
}